{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Dropbox\_DOUTORADO\artigos\Artigo DEA-SFA XFactor\Analysis-DEA-SFA\DEA\logDEA.29 Apr 201823_10_36.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Apr 2018, 23:10:36
{txt}
{com}. 
. ** /////////////////////////////////////////////////////////////////////////////
> /************************************************************************
> (2) ANÁLISE DEA, TOMANDO COMO VARIÁVEIS:
> - INPUTS: REC; CUST;
> - OUTPUTS:  AVG;
> 
> 
> *************************************** Comentário anterior ************************************************************
> * A Escolha das variáveis leva em conta a análise realizada na parte (1), em que se 
> verifica a relação positiva entre Custos Totais por km e a avaliação geral do trecho, quando se avalia o efeito de cada variável por etapa no modelo RE. Por outro lado, o aumento da receita não implica em melhora na avaliação geral. Isto posto, o modelo parte da premissa de que, por meio da abordagem DEA orientada a input, é possível identificar aquelas unidades em há melhor equilíbrio relativo entre receitas, custos e avaliação geral. 
> A ideia seria classificar como ineficiente, aquela unidade em que as receitas estão em um nível muito elevado em relação aos custos totais e a avaliação geral do trecho.
> 
> Vale a observação de que Profeta (PROFETA, 2014: REGULAÇÃO E EFICIÊNCIA DOS MODELOS DE CONCESSÕES DE RODOVIAS NO BRASIL, TESE DE DOUTORADO - UFV/MG) entendeu que a eficiência estaria relacionada simplesmente à minimização dos custos totais. Assim elegeu como INPUT custos totais, e como OUTPUS Receitas Totais e Avaliação Geral. Contudo, aparentemente, Profeta não se atentou ao fato de que, de acordo com os relatórios financeiros das concessionárias, os custos totais incluem investimentos, que naturalmente implicam em melhora da condição da rodovia (e por consequência na sua avaliação. Assim, pode ser que não faça sentido a eficiência estar baseada na minimização desses custos.
> Os resultados da parte (1) parecem indicar também esse fato e, por isso, optou-se por uma configuração diferente de INPUTs e OUTPUTs.
> *************************************** Comentário atualizado **********************************************************
> 
> OUTPUT ORIENTED (para compatibilizar com SFA)
> 
> 
> *************************************************************************/
. 
. // apaga qualquer unidade que tenha valor de receita ou custo nulo 
. drop if rec  <=0 
{txt}(0 observations deleted)

{com}. drop if cust <=0
{txt}(1 observation deleted)

{com}. 
. /*
> subsititui os id's originais por id's para dados em painel (um id para cada concessionária)
> */
. // lista de concessionárias na base de dados 
. levelsof conc, local(concs)
{res}{txt}`"AUTOFERNAODIAS"' `"AUTOFLUMINENSE"' `"AUTOLITORALSUL"' `"AUTOPLANALTOSUL"' `"AUTOREGIS"' `"CCRPONTE "' `"CONCEBRA"' `"CONCEPA  "' `"CONCER"' `"CRO"' `"CRT"' `"ECO101"' `"ECOPONTE"' `"ECOSUL"' `"MGORODOVIAS"' `"MSVIA"' `"NOVADUTRA"' `"RODOVIADOACO"' `"TRANSBRASILIANA"' `"VIA040"' `"VIABAHIA"'

{com}. // contador local para gerar id
. local count 1
{txt}
{com}. // loop na lista de concessionárias
. foreach v in `concs'{c -(}
{txt}  2{com}.         
.         // substitui o id original, para os casos em que há match entre o nome da
.         // concessionária na base e na lista de nomes 
.         quietly replace id = `count' if conc == "`v'"
{txt}  3{com}.         local ++count // atualiza o contador de id
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // gera variáveis dummy para marcar as etapas
. quietly gen dEtapa2 = (etp==2)
{txt}
{com}. quietly gen dEtapa3 = (etp==3)
{txt}
{com}. 
. // Como a análise na parte (1) indicou não haver variação relevante nas variáveis ao longo do tempo, optou-se por calcular as médias do período das variáveis de input e output
. quietly bysort id: egen custm = mean(cust_km)
{txt}
{com}. quietly bysort id: egen recm = mean(rec_km)
{txt}
{com}. quietly bysort id: egen avgm = mean(avg)
{txt}
{com}. quietly bysort id: egen tarm = mean(tar)
{txt}
{com}. // identifica duplicatas
. quietly by id: gen dup = cond(_N==1, 0, _n)
{txt}
{com}. // apaga duplicatas
. drop if dup > 1
{txt}(60 observations deleted)

{com}. 
. // gera índices para as DMUs
. quietly gen dmu = id
{txt}
{com}. 
. // apaga variáveis dispensáveis para a análise DEA
. quietly drop id ano anoconc cust cust_km rec rec_km avg dup
{txt}
{com}. 
. // salva dados para simulação DEA
. save data_dea, replace
{txt}file data_dea.dta saved

{com}. 
. // define inputs e outputs da análise DEA
. global inp recm custm
{txt}
{com}. global out avgm 
{txt}
{com}. 
. 
. /***********************************************************************
> ANÁLISE DEA CONSIDERANDO AS ORIENTAÇÕES INPUT E OUTPUT
> ************************************************************************/
. foreach direction in i o{c -(}
{txt}  2{com}. 
.         * DEA - variable returns to scale
.         quietly: dea $inp = $out, rts(vrs) ort(`direction') stage(2) saving(dea_results)
{txt}  3{com}.         mat deascores = r(dearslt)
{txt}  4{com}.         mat deascores = deascores[1...,"theta"]
{txt}  5{com}.         sort dmu
{txt}  6{com}.         cap drop dea1
{txt}  7{com}.         svmat deascores, names(dea)
{txt}  8{com}.         rename dea1 deascore_`direction'
{txt}  9{com}.         gen efficient_`direction' = deascore_`direction' == 1
{txt} 10{com}. 
. {c )-}
options: RTS(VRS) ORT(IN) STAGE(2)
{res}{com}options: RTS(VRS) ORT(OUT) STAGE(2)
{res}{txt}
{com}. 
. * Escores de eficiência após primeiro estágio
. tabstat deascore_i deascore_o efficient_i efficient_o, columns(statistics) statistics(mean sd median min max) format(%7.0g)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       p50       min       max
{hline 13}{c +}{hline 50}
{ralign 12:deascore_i} {...}
{c |}{...}
   {res} .66718    .35549     .6983    .02532         1
{txt}{ralign 12:deascore_o} {...}
{c |}{...}
   {res}  .9185    .07844    .91342    .71903         1
{txt}{ralign 12:efficient_i} {...}
{c |}{...}
   {res} .38095    .49761         0         0         1
{txt}{ralign 12:efficient_o} {...}
{c |}{...}
   {res} .28571    .46291         0         0         1
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. 
. di " ##### ANÁLISE DEA - INPUTS: REC;CUST - OUTPUTS: AVG ##### "
{res} ##### ANÁLISE DEA - INPUTS: REC;CUST - OUTPUTS: AVG ##### 
{txt}
{com}. 
. list dmu conc deascore_i deascore_o
{txt}
     {c TLC}{hline 5}{c -}{hline 17}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}dmu              conc   deasco~i   deasco~o {txt}{c |}
     {c LT}{hline 5}{c -}{hline 17}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}  1    AUTOFERNAODIAS   .5564293   .8017424 {txt}{c |}
  2. {c |} {res}  2    AUTOFLUMINENSE   .1168521   .8607054 {txt}{c |}
  3. {c |} {res}  3    AUTOLITORALSUL   .4055709   .8908237 {txt}{c |}
  4. {c |} {res}  4   AUTOPLANALTOSUL   .8637795   .8661183 {txt}{c |}
  5. {c |} {res}  5         AUTOREGIS          1          1 {txt}{c |}
     {c LT}{hline 5}{c -}{hline 17}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res}  6         CCRPONTE    .0253207   .8888889 {txt}{c |}
  7. {c |} {res}  7          CONCEBRA          1   .9134218 {txt}{c |}
  8. {c |} {res}  8         CONCEPA     .1230568   .7190304 {txt}{c |}
  9. {c |} {res}  9            CONCER    .180785   .8926107 {txt}{c |}
 10. {c |} {res} 10               CRO   .9060524    .985593 {txt}{c |}
     {c LT}{hline 5}{c -}{hline 17}{c -}{hline 10}{c -}{hline 10}{c RT}
 11. {c |} {res} 11               CRT   .2226738   .9478757 {txt}{c |}
 12. {c |} {res} 12            ECO101   .6808634   .8459402 {txt}{c |}
 13. {c |} {res} 13          ECOPONTE          1          1 {txt}{c |}
 14. {c |} {res} 14            ECOSUL          1          1 {txt}{c |}
 15. {c |} {res} 15       MGORODOVIAS   .6971925   .9517775 {txt}{c |}
     {c LT}{hline 5}{c -}{hline 17}{c -}{hline 10}{c -}{hline 10}{c RT}
 16. {c |} {res} 16             MSVIA          1   .8857613 {txt}{c |}
 17. {c |} {res} 17         NOVADUTRA   .5338981   .9845045 {txt}{c |}
 18. {c |} {res} 18      RODOVIADOACO          1          1 {txt}{c |}
 19. {c |} {res} 19   TRANSBRASILIANA          1          1 {txt}{c |}
 20. {c |} {res} 20            VIA040          1          1 {txt}{c |}
     {c LT}{hline 5}{c -}{hline 17}{c -}{hline 10}{c -}{hline 10}{c RT}
 21. {c |} {res} 21          VIABAHIA   .6982967   .8537034 {txt}{c |}
     {c BLC}{hline 5}{c -}{hline 17}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. /************************************************************************
> SECOND-STAGE REGRESSION ANALYSIS - TOBIT
> 
> *************************************************************************/
. * variáveis explicativas
. global reglist npp ext tar dEtapa2 dEtapa3
{txt}
{com}. 
. tabstat $reglist, columns(statistics) statistics(mean sd median min max) format(%7.0g)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       p50       min       max
{hline 13}{c +}{hline 50}
{ralign 12:npp} {...}
{c |}{...}
   {res}  5.381     3.041         5         1        11
{txt}{ralign 12:ext} {...}
{c |}{...}
   {res} 452.42    311.73       402      13.2    1176.5
{txt}{ralign 12:tar} {...}
{c |}{...}
   {res} 4.9443    2.9474       3.6       1.4     12.22
{txt}{ralign 12:dEtapa2} {...}
{c |}{...}
   {res} .38095    .49761         0         0         1
{txt}{ralign 12:dEtapa3} {...}
{c |}{...}
   {res} .33333    .48305         0         0         1
{txt}{hline 13}{c BT}{hline 50}

{com}.  
. * (Naive) Censored Regression Analysis - eficiência orientada a input
. /*
> quietly: stepwise, pr(.20): tobit deascore_i $reglist, ul(1) /* backward selection */
> eststo tob_inp
> */
. 
. * (Naive) Censored Regression Analysis - eficiência orientada a output
. quietly: stepwise, pr(.20): tobit deascore_o $reglist, ul(1) /* backward selection */
{txt}
{com}. eststo tob_out
{txt}
{com}. 
. /************************************************************************
> SECOND-STAGE REGRESSION ANALYSIS - Procedimento Simar & Wilson (2007)
> 
> *************************************************************************/
. * Simar & Wilson (2007) Procedure - orientado a input
. // simarwilson deascore_i $reglist, unit dots reps(1999) 
. // eststo sw_inp
. 
. * Simar & Wilson (2007) Procedure - orientado a output
. simarwilson deascore_o $reglist, unit dots reps(1999)
{err}command {bf}simarwilson{sf} is unrecognized
{txt}{search r(199), local:r(199);}

end of do-file

{search r(199), local:r(199);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\Dropbox\_DOUTORADO\artigos\Artigo DEA-SFA XFactor\Analysis-DEA-SFA\DEA\logDEA.29 Apr 201823_10_36.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 Apr 2018, 23:10:55
{txt}{.-}
{smcl}
{txt}{sf}{ul off}