{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Google Drive\_DOUTORADO\__TESE\__CODEandDATA\__TESE_code-data\efficiency\Stata\SFA\logSFA.23 Feb 202113_11_28.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Feb 2021, 13:11:28
{txt}
{com}. 
. /************************************************************************
> (3) ANÁLISE SFA, TOMANDO COMO VARIÁVEIS:
> - INPUTS: REC; CUST;
> - OUTPUTS: AVG 
> 
> OUTPUT ORIENTED
> *************************************************************************/
. * set the directory to the location of .ado files 
. * .ado files from:
. *
. * A Practitioner's Guide to Stochastic Frontier Analysis Using Stata         
. * Subal C. Kumbhakar, Hung-Jen Wang and Alan P. Horncastle                     
. *                                                                               
. //adopath ++ "C:\ado\personal\sfbook\sfbook_ado"
. 
. // apaga qualquer unidade que tenha valor de receita ou custo nulo 
. //drop if rec  <=0 
. //drop if cust <=0
. 
. /*
> subsititui os id's originais por id's para dados em painel (um id para cada concessionária)
> */
. // lista de concessionárias na base de dados 
. levelsof conc, local(concs)
{res}{txt}`"AUTOFERNAODIAS"' `"AUTOFLUMINENSE"' `"AUTOLITORALSUL"' `"AUTOPLANALTOSUL"' `"AUTOREGIS"' `"CCRPONTE"' `"CONCEBRA"' `"CONCEPA"' `"CONCER"' `"CRO"' `"CRT"' `"ECO101"' `"ECOPONTE"' `"ECOSUL"' `"MGORODOVIAS"' `"MSVIA"' `"NOVADUTRA"' `"RODOVIADOACO"' `"TRANSBRASILIANA"' `"VIA040"' `"VIABAHIA"'

{com}. // contador local para gerar id
. local count 1
{txt}
{com}. // loop na lista de concessionárias
. foreach v in `concs'{c -(}
{txt}  2{com}.         
.         // substitui o id original, para os casos em que há match entre o nome da
.         // concessionária na base e na lista de nomes 
.         quietly replace id = `count' if conc == "`v'"
{txt}  3{com}.         local ++count // atualiza o contador de id
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // gera variáveis dummy para marcar as etapas
. quietly gen dEtapa2 = (etp==2)
{txt}
{com}. quietly gen dEtapa3 = (etp==3)
{txt}
{com}. 
. // Como a análise na parte (1) indicou não haver variação relevante nas variáveis ao longo do tempo, optou-se por calcular as médias do período das variáveis de input e output
. quietly bysort id: egen custm = mean(cust_km_adj)
{txt}
{com}. quietly bysort id: egen recm = mean(rec_km_adj)
{txt}
{com}. quietly bysort id: egen avgm = mean(avg)
{txt}
{com}. quietly bysort id: egen tarm = mean(tar_adj)
{txt}
{com}. // identifica duplicatas
. quietly by id: gen dup = cond(_N==1, 0, _n)
{txt}
{com}. // apaga duplicatas
. drop if dup > 1
{txt}(61 observations deleted)

{com}. 
. // gera índices para as DMUs
. quietly gen dmu = id
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. save data_sfa, replace
{txt}file data_sfa.dta saved

{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. gen l_rec = log(recm)
{txt}
{com}. gen l_cust = log(custm)
{txt}
{com}. gen l_avg = log(avgm)
{txt}
{com}. 
. // define inputs e outputs da análise SFA
. global inp l_cust l_rec
{txt}
{com}. global out l_avg
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. global reglist npp ext tar dEtapa2 dEtapa3
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. reg $out $inp

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 18)        = {res}     0.71
{txt}       Model {c |} {res} .013145006         2  .006572503   {txt}Prob > F        ={res}    0.5067
{txt}    Residual {c |} {res} .167518403        18  .009306578   {txt}R-squared       ={res}    0.0728
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0303
{txt}       Total {c |} {res} .180663408        20   .00903317   {txt}Root MSE        =   {res} .09647

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0336523{col 26}{space 2} .0473419{col 37}{space 1}   -0.71{col 46}{space 3}0.486{col 54}{space 4}-.1331139{col 67}{space 3} .0658093
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0395258{col 26}{space 2} .0358908{col 37}{space 1}    1.10{col 46}{space 3}0.285{col 54}{space 4}-.0358781{col 67}{space 3} .1149297
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.321686{col 26}{space 2} .1756892{col 37}{space 1}    7.52{col 46}{space 3}0.000{col 54}{space 4} .9525771{col 67}{space 3} 1.690796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict e, residual
{txt}
{com}. sum e, detail

                          {txt}Residuals
{hline 61}
      Percentiles      Smallest
 1%    {res}-.2426055      -.2426055
{txt} 5%    {res}-.1241298      -.1241298
{txt}10%    {res}-.0845446      -.0845446       {txt}Obs         {res}         21
{txt}25%    {res}-.0576841      -.0617275       {txt}Sum of Wgt. {res}         21

{txt}50%    {res}-.0001136                      {txt}Mean          {res}-6.02e-10
                        {txt}Largest       Std. Dev.     {res} .0915201
{txt}75%    {res} .0673245        .098525
{txt}90%    {res}  .100082        .100082       {txt}Variance      {res} .0083759
{txt}95%    {res} .1187358       .1187358       {txt}Skewness      {res}-.6730419
{txt}99%    {res} .1353063       .1353063       {txt}Kurtosis      {res} 3.470593
{txt}
{com}. sktest e, noadj
{res}
{txt}Skewness and kurtosis tests for normality
{col 58}{hline 3} Joint test {hline 3}
{col 5}Variable {c |}{col 22}Obs   Pr(skewness)   Pr(kurtosis)   chi2(2)  Prob>chi2
{hline 13}{c +}{hline 61}
           e {c |}{res}{col 16}       21{col 34}0.1402{col 49}0.2716{col 56}     3.38{col 70}0.1841
{txt}
{com}. * notar que a distribuição é assimétrica para a esquerda (Skewness < 0)
. quietly sum e
{txt}
{com}. local e_mean = r(mean)
{txt}
{com}. local N = r(N)
{txt}
{com}. egen double m2 = mean((e - `e_mean')^2)
{txt}
{com}. egen double m3 = mean((e - `e_mean')^3)
{txt}
{com}. gen double M3T = m3/sqrt(6*((m2)^3)/`N')
{txt}
{com}. di "Como ", M3T[1], " é negativo, então os resíduos são assimétricos para a esquerda (rejeição de H0: não há assimetria). "
{res}Como  -1.2591461  é negativo, então os resíduos são assimétricos para a esquerda (rejeição de H0: não há assimetria). 
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. // (1) OLS - Fronteira determinística
. reg $out $inp, noconstant

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 19)        = {res}   516.70
{txt}       Model {c |} {res} 37.7580912         2  18.8790456   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .694210324        19  .036537385   {txt}R-squared       ={res}    0.9819
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9800
{txt}       Total {c |} {res} 38.4523015        21  1.83106198   {txt}Root MSE        =   {res} .19115

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2} .2181887{col 26}{space 2} .0663272{col 37}{space 1}    3.29{col 46}{space 3}0.004{col 54}{space 4} .0793643{col 67}{space 3}  .357013
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2}-.0263974{col 26}{space 2} .0689621{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-.1707368{col 67}{space 3}  .117942
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo OLS
{txt}
{com}. 
. predict e_ols, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_ols /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eff_ols = exp(e_ols)
{txt}
{com}. summarize eff_ols

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}         21     1.03627    .1996888   .6962408   1.623159
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. *********************************************************************************************
. // (2) COLS - Fronteira determinística (OLS Corrigido)
. reg $out $inp, noconstant

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 19)        = {res}   516.70
{txt}       Model {c |} {res} 37.7580912         2  18.8790456   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .694210324        19  .036537385   {txt}R-squared       ={res}    0.9819
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9800
{txt}       Total {c |} {res} 38.4523015        21  1.83106198   {txt}Root MSE        =   {res} .19115

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2} .2181887{col 26}{space 2} .0663272{col 37}{space 1}    3.29{col 46}{space 3}0.004{col 54}{space 4} .0793643{col 67}{space 3}  .357013
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2}-.0263974{col 26}{space 2} .0689621{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-.1707368{col 67}{space 3}  .117942
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo COLS
{txt}
{com}. 
. predict e_cols, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_cols /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double u_star = -(e_cols - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_cols = exp(-u_star) /* calcula eficiência técnica */
{txt}
{com}. summarize eff_cols

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eff_cols {c |}{res}         21    .6384277    .1230248   .4289418          1
{txt}
{com}. list conc u_star eff_cols
{txt}
     {c TLC}{hline 17}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}           conc      u_star    eff_cols {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} AUTOFERNAODIAS   .57790539   .56107237 {txt}{c |}
  2. {c |} {res} AUTOFLUMINENSE   .55370738    .5748148 {txt}{c |}
  3. {c |} {res} AUTOLITORALSUL    .5682221   .56653178 {txt}{c |}
  4. {c |} {res}AUTOPLANALTOSUL   .48921015   .61311047 {txt}{c |}
  5. {c |} {res}      AUTOREGIS   .45868563   .63211393 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}       CCRPONTE    .7701945   .46292302 {txt}{c |}
  7. {c |} {res}       CONCEBRA   .42414844   .65432675 {txt}{c |}
  8. {c |} {res}        CONCEPA   .84643397   .42894183 {txt}{c |}
  9. {c |} {res}         CONCER   .62420855   .53568523 {txt}{c |}
 10. {c |} {res}            CRO   .37809358   .68516638 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 11. {c |} {res}            CRT    .3586407   .69862532 {txt}{c |}
 12. {c |} {res}         ECO101   .39188933    .6757789 {txt}{c |}
 13. {c |} {res}       ECOPONTE   .59887905   .54942717 {txt}{c |}
 14. {c |} {res}         ECOSUL           0           1 {txt}{c |}
 15. {c |} {res}    MGORODOVIAS   .37881842   .68466992 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 16. {c |} {res}          MSVIA   .52882733   .58929561 {txt}{c |}
 17. {c |} {res}      NOVADUTRA    .5253009   .59137739 {txt}{c |}
 18. {c |} {res}   RODOVIADOACO   .25353843   .77604992 {txt}{c |}
 19. {c |} {res}TRANSBRASILIANA   .23650214   .78938419 {txt}{c |}
 20. {c |} {res}         VIA040   .32925661   .71945837 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 21. {c |} {res}       VIABAHIA   .48089685   .61822868 {txt}{c |}
     {c BLC}{hline 17}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. qreg $out $inp /* regressão quantílica - utiliza a mediana */
{txt}Iteration  1:  WLS sum of weighted deviations = {res} .73159192

{txt}Iteration  1: sum of abs. weighted deviations = {res} .73190012
{txt}Iteration  2: sum of abs. weighted deviations = {res} .72797012

{txt}Median regression{col 53}Number of obs = {res}        21
{txt}  Raw sum of deviations{res} .8023613{txt} (about {res}1.3862944{txt})
  Min sum of deviations{res} .7279701{col 53}{txt}Pseudo R2     = {res}    0.0927

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0422098{col 26}{space 2} .0833144{col 37}{space 1}   -0.51{col 46}{space 3}0.619{col 54}{space 4}-.2172468{col 67}{space 3} .1328272
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2}  .046818{col 26}{space 2} .0631623{col 37}{space 1}    0.74{col 46}{space 3}0.468{col 54}{space 4}-.0858811{col 67}{space 3} .1795172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.32528{col 26}{space 2} .3091859{col 37}{space 1}    4.29{col 46}{space 3}0.000{col 54}{space 4} .6757045{col 67}{space 3} 1.974855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo CMAD
{txt}
{com}. 
. predict e_cmad, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_cmad /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_star_q = -(e_cmad - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_cmad = exp(-eta_star_q) /* calcula eficiência técnica */
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. frontier $out $inp
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:  21.76362}  (not concave)
Iteration 1:{space 3}log likelihood = {res: 22.037521}  
Iteration 2:{space 3}log likelihood = {res: 22.220589}  
Iteration 3:{space 3}log likelihood = {res: 22.353624}  (not concave)
Iteration 4:{space 3}log likelihood = {res: 22.588168}  
Iteration 5:{space 3}log likelihood = {res: 23.025718}  
Iteration 6:{space 3}log likelihood = {res:  23.21679}  
Iteration 7:{space 3}log likelihood = {res: 23.346657}  
Iteration 8:{space 3}log likelihood = {res: 23.417548}  
Iteration 9:{space 3}log likelihood = {res: 23.462199}  
Iteration 10:{space 2}log likelihood = {res: 23.473192}  
Iteration 11:{space 2}log likelihood = {res: 23.483018}  
Iteration 12:{space 2}log likelihood = {res: 23.491162}  
Iteration 13:{space 2}log likelihood = {res: 23.494238}  
Iteration 14:{space 2}log likelihood = {res: 23.496076}  
Iteration 15:{space 2}log likelihood = {res: 23.497236}  
Iteration 16:{space 2}log likelihood = {res: 23.523205}  
Iteration 17:{space 2}log likelihood = {res: 23.523605}  
Iteration 18:{space 2}log likelihood = {res: 23.523982}  
Iteration 19:{space 2}log likelihood = {res: 23.524191}  
Iteration 20:{space 2}log likelihood = {res: 23.524326}  
Iteration 21:{space 2}log likelihood = {res: 23.524382}  
Iteration 22:{space 2}log likelihood = {res: 23.524445}  
Iteration 23:{space 2}log likelihood = {res:  23.52448}  
Iteration 24:{space 2}log likelihood = {res: 23.524495}  (not concave)
Iteration 25:{space 2}log likelihood = {res: 23.524498}  
Iteration 26:{space 2}log likelihood = {res: 23.524502}  
Iteration 27:{space 2}log likelihood = {res: 23.524506}  (not concave)
Iteration 28:{space 2}log likelihood = {res: 23.524507}  
Iteration 29:{space 2}log likelihood = {res:  23.52451}  (not concave)
Iteration 30:{space 2}log likelihood = {res:  23.52451}  
Iteration 31:{space 2}log likelihood = {res: 23.524513}  (not concave)
Iteration 32:{space 2}log likelihood = {res: 23.524513}  
{res}
{txt}Stoc. frontier normal/half-normal model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(1)}{col 67}=          {res}.
{txt}Log likelihood = {res} 23.524513{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0891079{col 26}{space 2} .0739688{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4} -.234084{col 67}{space 3} .0558683
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0747081{col 26}{space 2} .0551096{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4}-.0333048{col 67}{space 3}  .182721
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.600201{col 26}{space 2} .1408171{col 37}{space 1}   11.36{col 46}{space 3}0.000{col 54}{space 4} 1.324205{col 67}{space 3} 1.876197
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2v {c |}{col 14}{res}{space 2}-36.06429{col 26}{space 2} 762.9641{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-1531.446{col 67}{space 3} 1459.318
{txt}    /lnsig2u {c |}{col 14}{res}{space 2}-3.692012{col 26}{space 2} .3086069{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-4.296871{col 67}{space 3}-3.087154
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} 1.47e-08{col 26}{space 2} 5.63e-06{col 54}{space 4}        0{col 67}{space 3}        .
{txt}     sigma_u {c |}{col 14}{res}{space 2} .1578664{col 26}{space 2} .0243593{col 54}{space 4} .1166666{col 67}{space 3} .2136156
{txt}      sigma2 {c |}{col 14}{res}{space 2} .0249218{col 26}{space 2}  .007691{col 54}{space 4} .0098476{col 67}{space 3}  .039996
{txt}      lambda {c |}{col 14}{res}{space 2} 1.07e+07{col 26}{space 2} .0243593{col 54}{space 4} 1.07e+07{col 67}{space 3} 1.07e+07
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}5.19{col 56}{txt}Prob >= chibar2 = {res}0.011
{txt}
{com}. eststo sfa_hn
{txt}
{com}. 
. predict e_hn, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_hn /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_hn= -(e_hn - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_hn = exp(-eta_hn) /* calcula eficiência técnica */
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. *********************************************************************************************
. * (5) Cobb-Douglas Exponential Model
. frontier $out $inp, distribution(exponential)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: 21.607845}  
Iteration 1:{space 3}log likelihood = {res: 21.700348}  
Iteration 2:{space 3}log likelihood = {res: 21.701391}  
Iteration 3:{space 3}log likelihood = {res: 21.701391}  
{res}
{txt}Stoc. frontier normal/exponential model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}      2.75
{txt}Log likelihood = {res} 21.701391{txt}{col 49}Prob > chi2{col 67}= {res}    0.2532

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0268575{col 26}{space 2} .0382039{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.1017359{col 67}{space 3} .0480208
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0410484{col 26}{space 2}  .029511{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.0167921{col 67}{space 3} .0988889
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.330706{col 26}{space 2} .1424451{col 37}{space 1}    9.34{col 46}{space 3}0.000{col 54}{space 4} 1.051519{col 67}{space 3} 1.609894
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2v {c |}{col 14}{res}{space 2}-5.593316{col 26}{space 2} .6492997{col 37}{space 1}   -8.61{col 46}{space 3}0.000{col 54}{space 4} -6.86592{col 67}{space 3}-4.320712
{txt}    /lnsig2u {c |}{col 14}{res}{space 2}-5.438704{col 26}{space 2} .9605757{col 37}{space 1}   -5.66{col 46}{space 3}0.000{col 54}{space 4}-7.321397{col 67}{space 3} -3.55601
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} .0610136{col 26}{space 2} .0198081{col 54}{space 4} .0322912{col 67}{space 3} .1152841
{txt}     sigma_u {c |}{col 14}{res}{space 2} .0659175{col 26}{space 2} .0316594{col 54}{space 4} .0257145{col 67}{space 3} .1689749
{txt}      sigma2 {c |}{col 14}{res}{space 2} .0080678{col 26}{space 2}  .003324{col 54}{space 4} .0015528{col 67}{space 3} .0145827
{txt}      lambda {c |}{col 14}{res}{space 2} 1.080373{col 26}{space 2} .0464102{col 54}{space 4} .9894107{col 67}{space 3} 1.171335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}1.54{col 56}{txt}Prob >= chibar2 = {res}0.107
{txt}
{com}. eststo sfa_exp
{txt}
{com}. 
. predict e_exp, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_exp /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_exp= -(e_exp - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_exp = exp(-eta_exp) /* calcula eficiência técnica */
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. frontier $out $inp, uhet($reglist) vce(cluster etp) 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:  21.76362}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: 25.459392}  (not concave)
Iteration 2:{space 3}log pseudolikelihood = {res: 25.744443}  (not concave)
Iteration 3:{space 3}log pseudolikelihood = {res: 25.822136}  
Iteration 4:{space 3}log pseudolikelihood = {res: 25.884051}  
Iteration 5:{space 3}log pseudolikelihood = {res: 25.934269}  
Iteration 6:{space 3}log pseudolikelihood = {res:  25.99404}  (not concave)
Iteration 7:{space 3}log pseudolikelihood = {res: 26.355602}  
Iteration 8:{space 3}log pseudolikelihood = {res: 27.055397}  (not concave)
Iteration 9:{space 3}log pseudolikelihood = {res: 27.440093}  
Iteration 10:{space 2}log pseudolikelihood = {res: 27.890708}  
Iteration 11:{space 2}log pseudolikelihood = {res: 27.998033}  (backed up)
Iteration 12:{space 2}log pseudolikelihood = {res: 28.038205}  
Iteration 13:{space 2}log pseudolikelihood = {res: 28.094485}  
Iteration 14:{space 2}log pseudolikelihood = {res: 28.122902}  
Iteration 15:{space 2}log pseudolikelihood = {res: 28.138444}  
Iteration 16:{space 2}log pseudolikelihood = {res: 28.146506}  
Iteration 17:{space 2}log pseudolikelihood = {res: 28.150739}  
Iteration 18:{space 2}log pseudolikelihood = {res: 28.153643}  
Iteration 19:{space 2}log pseudolikelihood = {res:  28.15529}  
Iteration 20:{space 2}log pseudolikelihood = {res: 28.155921}  
Iteration 21:{space 2}log pseudolikelihood = {res: 28.156583}  
Iteration 22:{space 2}log pseudolikelihood = {res: 28.156911}  
Iteration 23:{space 2}log pseudolikelihood = {res: 28.157048}  
Iteration 24:{space 2}log pseudolikelihood = {res: 28.157103}  
Iteration 25:{space 2}log pseudolikelihood = {res: 28.157153}  
Iteration 26:{space 2}log pseudolikelihood = {res: 28.157197}  
Iteration 27:{space 2}log pseudolikelihood = {res: 28.157216}  
Iteration 28:{space 2}log pseudolikelihood = {res: 28.157226}  
Iteration 29:{space 2}log pseudolikelihood = {res: 28.157233}  
Iteration 30:{space 2}log pseudolikelihood = {res: 28.157238}  
Iteration 31:{space 2}log pseudolikelihood = {res: 28.157242}  
Iteration 32:{space 2}log pseudolikelihood = {res: 28.157245}  
Iteration 33:{space 2}log pseudolikelihood = {res: 28.157247}  
{res}
{txt}Stoc. frontier normal/half-normal model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(0)}{col 67}=          {res}.
{txt}Log pseudolikelihood = {res} 28.157247{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{ralign 78:(Std. Err. adjusted for {res:3} clusters in etp)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}l_avg        {txt}{c |}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.1058696{col 26}{space 2} 2.69e-09{col 37}{space 1}-3.9e+07{col 46}{space 3}0.000{col 54}{space 4}-.1058697{col 67}{space 3}-.1058696
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0871963{col 26}{space 2} 1.57e-09{col 37}{space 1} 5.6e+07{col 46}{space 3}0.000{col 54}{space 4} .0871963{col 67}{space 3} .0871963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.632111{col 26}{space 2} 8.44e-09{col 37}{space 1} 1.9e+08{col 46}{space 3}0.000{col 54}{space 4} 1.632111{col 67}{space 3} 1.632111
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2v      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-38.97108{col 26}{space 2} .3236569{col 37}{space 1} -120.41{col 46}{space 3}0.000{col 54}{space 4}-39.60544{col 67}{space 3}-38.33672
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2u      {txt}{c |}
{space 9}npp {c |}{col 14}{res}{space 2} 1.323922{col 26}{space 2} .7036022{col 37}{space 1}    1.88{col 46}{space 3}0.060{col 54}{space 4}-.0551128{col 67}{space 3} 2.702957
{txt}{space 9}ext {c |}{col 14}{res}{space 2}-.0067334{col 26}{space 2} .0044357{col 37}{space 1}   -1.52{col 46}{space 3}0.129{col 54}{space 4}-.0154272{col 67}{space 3} .0019605
{txt}{space 9}tar {c |}{col 14}{res}{space 2}  .223544{col 26}{space 2} .1462079{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-.0630182{col 67}{space 3} .5101062
{txt}{space 5}dEtapa2 {c |}{col 14}{res}{space 2}-2.245571{col 26}{space 2} .4626372{col 37}{space 1}   -4.85{col 46}{space 3}0.000{col 54}{space 4}-3.152323{col 67}{space 3}-1.338818
{txt}{space 5}dEtapa3 {c |}{col 14}{res}{space 2}-4.339509{col 26}{space 2} 1.582706{col 37}{space 1}   -2.74{col 46}{space 3}0.006{col 54}{space 4}-7.441555{col 67}{space 3}-1.237463
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.014147{col 26}{space 2} 1.877113{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-10.69322{col 67}{space 3}-3.335074
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} 3.45e-09{col 26}{space 2} 5.58e-10{col 54}{space 4} 2.51e-09{col 67}{space 3} 4.73e-09
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo sfa_hn_ex
{txt}
{com}. 
. predict e_hnx, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_hnx /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_hnx= -(e_hnx - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_hnx = exp(-eta_hnx) /* calcula eficiência técnica */
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. frontier $out $inp, distribution(exponential) uhet(ext) vce(cluster etp) 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res: 21.607845}  
Iteration 1:{space 3}log pseudolikelihood = {res: 21.859579}  
Iteration 2:{space 3}log pseudolikelihood = {res: 21.878186}  
Iteration 3:{space 3}log pseudolikelihood = {res: 21.878724}  
Iteration 4:{space 3}log pseudolikelihood = {res: 21.878725}  
{res}
{txt}Stoc. frontier normal/exponential model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(0)}{col 67}=          {res}.
{txt}Log pseudolikelihood = {res} 21.878725{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{ralign 78:(Std. Err. adjusted for {res:3} clusters in etp)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}l_avg        {txt}{c |}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0304023{col 26}{space 2} .0208742{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4}-.0713149{col 67}{space 3} .0105103
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0515261{col 26}{space 2} .0067406{col 37}{space 1}    7.64{col 46}{space 3}0.000{col 54}{space 4} .0383147{col 67}{space 3} .0647375
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.276562{col 26}{space 2} .1885271{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4}  .907056{col 67}{space 3} 1.646069
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2v      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-5.445824{col 26}{space 2} .1747748{col 37}{space 1}  -31.16{col 46}{space 3}0.000{col 54}{space 4}-5.788376{col 67}{space 3}-5.103271
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2u      {txt}{c |}
{space 9}ext {c |}{col 14}{res}{space 2}-.0018628{col 26}{space 2} .0033064{col 37}{space 1}   -0.56{col 46}{space 3}0.573{col 54}{space 4}-.0083432{col 67}{space 3} .0046176
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.989863{col 26}{space 2} 1.231254{col 37}{space 1}   -4.05{col 46}{space 3}0.000{col 54}{space 4}-7.403077{col 67}{space 3}-2.576649
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} .0656832{col 26}{space 2} .0057399{col 54}{space 4}  .055344{col 67}{space 3} .0779541
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo sfa_exp_ex
{txt}
{com}. 
. predict e_expx, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_expx /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_expx= -(e_expx - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_expx = exp(-eta_expx) /* calcula eficiência técnica */
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. summarize eff_ols eff_cols eff_cmad

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}         21     1.03627    .1996888   .6962408   1.623159
{txt}{space 4}eff_cols {c |}{res}         21    .6384277    .1230248   .4289418          1
{txt}{space 4}eff_cmad {c |}{res}         21     .877152    .0781568   .6844466          1
{txt}
{com}. list dmu conc eff_ols eff_cols eff_cmad eff_hn eff_exp eff_hnx eff_expx 

     {txt}{c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  1. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  1 {txt}{c |} {res} AUTOFERNAODIAS {txt}{c |} {res}.91070967 {txt}{c |} {res}.56107237 {txt}{c |} {res}.77285913 {txt}{c |} {res}.88815879 {txt}{c |} {res}.88210062 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.88548501                {txt}{c |}                {res}.85310825                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  2. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  2 {txt}{c |} {res} AUTOFLUMINENSE {txt}{c |} {res}.93301582 {txt}{c |} {res} .5748148 {txt}{c |} {res} .8796492 {txt}{c |} {res}.76779355 {txt}{c |} {res}.81225002 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.76142046                {txt}{c |}                {res} .8091699                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  3. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  3 {txt}{c |} {res} AUTOLITORALSUL {txt}{c |} {res}.91957116 {txt}{c |} {res}.56653178 {txt}{c |} {res}.86729091 {txt}{c |} {res}.77952236 {txt}{c |} {res}.81709644 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.77347436                {txt}{c |}                {res}.81193569                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  4. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  4 {txt}{c |} {res}AUTOPLANALTOSUL {txt}{c |} {res}.99517578 {txt}{c |} {res}.61311047 {txt}{c |} {res}.82739796 {txt}{c |} {res}.82664944 {txt}{c |} {res}.83542508 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.82208124                {txt}{c |}                {res}.82266883                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  5. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  5 {txt}{c |} {res}      AUTOREGIS {txt}{c |} {res}1.0260214 {txt}{c |} {res}.63211393 {txt}{c |} {res}.96825073 {txt}{c |} {res}.70034691 {txt}{c |} {res}.79252229 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}  .696033                {txt}{c |}                {res}.79302987                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  6. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  6 {txt}{c |} {res}       CCRPONTE {txt}{c |} {res}.75139767 {txt}{c |} {res}.46292302 {txt}{c |} {res}.85495246 {txt}{c |} {res}.79992623 {txt}{c |} {res} .8256521 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.80320398                {txt}{c |}                {res} .8386693                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  7. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  7 {txt}{c |} {res}       CONCEBRA {txt}{c |} {res}1.0620764 {txt}{c |} {res}.65432675 {txt}{c |} {res}.82960345 {txt}{c |} {res}.83057167 {txt}{c |} {res}.83231018 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.82762272                {txt}{c |}                {res}.80028757                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  8. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  8 {txt}{c |} {res}        CONCEPA {txt}{c |} {res}.69624079 {txt}{c |} {res}.42894183 {txt}{c |} {res}.68444665 {txt}{c |} {res}        1 {txt}{c |} {res}        1 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}        1                {txt}{c |}                {res}        1                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  9. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res}  9 {txt}{c |} {res}         CONCER {txt}{c |} {res} .8695023 {txt}{c |} {res}.53568523 {txt}{c |} {res}.85544998 {txt}{c |} {res}.79503386 {txt}{c |} {res}.82301419 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.79238659                {txt}{c |}                {res}.82370835                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 10. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 10 {txt}{c |} {res}            CRO {txt}{c |} {res} 1.112134 {txt}{c |} {res}.68516638 {txt}{c |} {res}.96873956 {txt}{c |} {res}.70020289 {txt}{c |} {res}.79206075 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.69428153                {txt}{c |}                {res}.78875173                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 11. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 11 {txt}{c |} {res}            CRT {txt}{c |} {res}  1.13398 {txt}{c |} {res}.69862532 {txt}{c |} {res}.86729091 {txt}{c |} {res}.81943419 {txt}{c |} {res}.81241191 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res} .8294479                {txt}{c |}                {res} .8154677                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 12. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 12 {txt}{c |} {res}         ECO101 {txt}{c |} {res}1.0968966 {txt}{c |} {res} .6757789 {txt}{c |} {res}.80098363 {txt}{c |} {res}.87758161 {txt}{c |} {res}.84980354 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.88190324                {txt}{c |}                {res}.83277301                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 13. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 13 {txt}{c |} {res}       ECOPONTE {txt}{c |} {res}.89180767 {txt}{c |} {res}.54942717 {txt}{c |} {res}.98113396 {txt}{c |} {res}.69385182 {txt}{c |} {res}.79165789 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.69428153                {txt}{c |}                {res}.79703588                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 14. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 14 {txt}{c |} {res}         ECOSUL {txt}{c |} {res} 1.623159 {txt}{c |} {res}        1 {txt}{c |} {res}.86729091 {txt}{c |} {res}.85603277 {txt}{c |} {res}.80681844 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.87698534                {txt}{c |}                {res}.80108279                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 15. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 15 {txt}{c |} {res}    MGORODOVIAS {txt}{c |} {res}1.1113282 {txt}{c |} {res}.68466992 {txt}{c |} {res}.92506402 {txt}{c |} {res}.74064389 {txt}{c |} {res} .7984021 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.73724674                {txt}{c |}                {res}.79659153                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 16. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 16 {txt}{c |} {res}          MSVIA {txt}{c |} {res}.95652049 {txt}{c |} {res}.58929561 {txt}{c |} {res}.82624587 {txt}{c |} {res}.81868181 {txt}{c |} {res}.83763656 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.81035752                {txt}{c |}                {res}.81077209                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 17. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 17 {txt}{c |} {res}      NOVADUTRA {txt}{c |} {res}.95989954 {txt}{c |} {res}.59137739 {txt}{c |} {res}.93145031 {txt}{c |} {res}.73958493 {txt}{c |} {res}.79820433 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.74182029                {txt}{c |}                {res} .7995814                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 18. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 18 {txt}{c |} {res}   RODOVIADOACO {txt}{c |} {res}1.2596524 {txt}{c |} {res}.77604992 {txt}{c |} {res}        1 {txt}{c |} {res}.69385182 {txt}{c |} {res} .7882676 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.69428153                {txt}{c |}                {res}.79019965                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 19. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 19 {txt}{c |} {res}TRANSBRASILIANA {txt}{c |} {res}1.2812961 {txt}{c |} {res}.78938419 {txt}{c |} {res}.95491452 {txt}{c |} {res}.73164703 {txt}{c |} {res}.79267071 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.73334738                {txt}{c |}                {res}.79320491                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 20. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 20 {txt}{c |} {res}         VIA040 {txt}{c |} {res}1.1677953 {txt}{c |} {res}.71945837 {txt}{c |} {res}.93281022 {txt}{c |} {res}.73569192 {txt}{c |} {res}.79665893 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.73201709                {txt}{c |}                {res}.79038444                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 21. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}   eff_exp {c |}
     {c |} {res} 21 {txt}{c |} {res}       VIABAHIA {txt}{c |} {res}1.0034835 {txt}{c |} {res}.61822868 {txt}{c |} {res}.82436718 {txt}{c |} {res}.83463546 {txt}{c |} {res}.83682646 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 17}{c BT}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c BT}{hline 11}{c BT}{hline 11}{c RT}
     {c |}                  eff_hnx                {c |}                 eff_expx                {c |}
     {c |}                {res}.83232847                {txt}{c |}                {res}.81688804                {txt}{c |}
     {c BLC}{hline 41}{c BT}{hline 41}{c BRC}

{com}. estimates table OLS COLS CMAD sfa_hn sfa_exp sfa_hn_ex sfa_exp_ex, b stats(N r2 r2_o r2_b r2_w F chi2) star (.05 .1 .2)
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 12:Variable} {c |} {center 13:OLS} {space 1} {center 13:COLS} {space 1} {center 13:CMAD} {space 1} {center 13:sfa_hn} {space 1}
{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:.21818869}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.21818869}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-.04220981}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:-.02639743}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.02639743}{lalign 3:}{txt} {space 1}{res} {ralign 10:.04681802}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:1.3252799}{lalign 3:***}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}l_avg        {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.08910785}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:.07470812}{lalign 3:*}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:1.6002011}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2v      {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-36.064287}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2u      {txt}{c |}{res}
{txt}{space 9}npp {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 9}ext {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 9}tar {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa2 {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa3 {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-3.6920122}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{lalign 12:Statistics}{txt} {c |} {center 13:} {space 1} {center 13:} {space 1} {center 13:} {space 1} {center 13:} {space 1}
{res}{txt}{ralign 12:N} {c |}{res} {ralign 10:21}{lalign 3:}{txt} {space 1}{res} {ralign 10:21}{lalign 3:}{txt} {space 1}{res} {ralign 10:21}{lalign 3:}{txt} {space 1}{res} {ralign 10:21}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2} {c |}{res} {ralign 10:.9819462}{lalign 3:}{txt} {space 1}{res} {ralign 10:.9819462}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2_o} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2_b} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2_w} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:F} {c |}{res} {ralign 10:516.70489}{lalign 3:}{txt} {space 1}{res} {ralign 10:516.70489}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:chi2} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:.}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 78:legend: * p<.2; ** p<.1; *** p<.05}

{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 12:Variable} {c |} {center 13:sfa_exp} {space 1} {center 13:sfa_hn_ex} {space 1} {center 13:sfa_exp_ex} {space 1}
{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}l_avg        {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:-.02685752}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.10586965}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-.03040232}{lalign 3:*}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:.04104842}{lalign 3:*}{txt} {space 1}{res} {ralign 10:.08719631}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.05152613}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.3307064}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.6321111}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.2765623}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2v      {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-5.5933162}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-38.971081}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-5.4458235}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2u      {txt}{c |}{res}
{txt}{space 9}npp {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:1.3239222}{lalign 3:**}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 9}ext {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.00673339}{lalign 3:*}{txt} {space 1}{res} {ralign 10:-.0018628}{lalign 3:}{txt} {space 1}
{res}{txt}{space 9}tar {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:.22354399}{lalign 3:*}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa2 {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-2.2455706}{lalign 3:***}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa3 {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-4.339509}{lalign 3:***}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-5.4387036}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-7.0141474}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-4.9898631}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{lalign 12:Statistics}{txt} {c |} {center 13:} {space 1} {center 13:} {space 1} {center 13:} {space 1}
{res}{txt}{ralign 12:N} {c |}{res} {ralign 10:21}{lalign 3:}{txt} {space 1}{res} {ralign 10:21}{lalign 3:}{txt} {space 1}{res} {ralign 10:21}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2_o} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2_b} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:r2_w} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:F} {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 12:chi2} {c |}{res} {ralign 10:2.7470387}{lalign 3:}{txt} {space 1}{res} {ralign 10:.}{lalign 3:}{txt} {space 1}{res} {ralign 10:.}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 62:legend: * p<.2; ** p<.1; *** p<.05}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD57a0_000000.tmp"
{txt}
{com}. *! Version 2017.21.11
. ********************************************************************************
. * Author: Carlos Eduardo Veras Neves                                                                       *
. *                                                                              *
. * Estimation of Technical Efficiency with SFA and DEA for Brazilian            *
. * Federal Toll Road Concessions 
. *                                                                              *
. ********************************************************************************
. * configuração inicial
. set trace off
{txt}
{com}. 
. clear all
{res}{txt}
{com}. 
. set more off
{txt}
{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}