{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Google Drive\_DOUTORADO\__TESE\__CODEandDATA\__TESE_code-data\efficiency\Stata\SFA\logSFA. 2 Mar 202121_00_05.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Mar 2021, 21:00:05
{txt}
{com}. 
. /************************************************************************
> (3) ANÁLISE SFA, TOMANDO COMO VARIÁVEIS:
> - INPUTS: REC; CUST;
> - OUTPUTS: AVG 
> 
> OUTPUT ORIENTED
> *************************************************************************/
. * set the directory to the location of .ado files 
. * .ado files from:
. *
. * A Practitioner's Guide to Stochastic Frontier Analysis Using Stata         
. * Subal C. Kumbhakar, Hung-Jen Wang and Alan P. Horncastle                     
. *                                                                               
. //adopath ++ "C:\ado\personal\sfbook\sfbook_ado"
. 
. // apaga qualquer unidade que tenha valor de receita ou custo nulo 
. //drop if rec  <=0 
. //drop if cust <=0
. 
. /*
> subsititui os id's originais por id's para dados em painel (um id para cada concessionária)
> */
. // lista de concessionárias na base de dados 
. levelsof conc, local(concs)
{res}{txt}`"AUTOFERNAODIAS"' `"AUTOFLUMINENSE"' `"AUTOLITORALSUL"' `"AUTOPLANALTOSUL"' `"AUTOREGIS"' `"CCRPONTE"' `"CONCEBRA"' `"CONCEPA"' `"CONCER"' `"CRO"' `"CRT"' `"ECO101"' `"ECOPONTE"' `"ECOSUL"' `"MGORODOVIAS"' `"MSVIA"' `"NOVADUTRA"' `"RODOVIADOACO"' `"TRANSBRASILIANA"' `"VIA040"' `"VIABAHIA"'

{com}. // contador local para gerar id
. local count 1
{txt}
{com}. // loop na lista de concessionárias
. foreach v in `concs'{c -(}
{txt}  2{com}.         
.         // substitui o id original, para os casos em que há match entre o nome da
.         // concessionária na base e na lista de nomes 
.         quietly replace id = `count' if conc == "`v'"
{txt}  3{com}.         local ++count // atualiza o contador de id
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // gera variáveis dummy para marcar as etapas
. quietly gen dEtapa2 = (etp==2)
{txt}
{com}. quietly gen dEtapa3 = (etp==3)
{txt}
{com}. 
. // Como a análise na parte (1) indicou não haver variação relevante nas variáveis ao longo do tempo, optou-se por calcular as médias do período das variáveis de input e output
. quietly bysort id: egen custm = mean(cust_km_adj)
{txt}
{com}. quietly bysort id: egen recm = mean(rec_km_adj)
{txt}
{com}. quietly bysort id: egen avgm = mean(avg)
{txt}
{com}. quietly bysort id: egen tarm = mean(tar_adj)
{txt}
{com}. // identifica duplicatas
. quietly by id: gen dup = cond(_N==1, 0, _n)
{txt}
{com}. // apaga duplicatas
. drop if dup > 1
{txt}(61 observations deleted)

{com}. 
. // gera índices para as DMUs
. quietly gen dmu = id
{txt}
{com}. 
. // apaga variáveis dispensáveis para a análise DEA
. //quietly drop id ano anoconc cust cust_km rec rec_km avg dup
. 
. // salva dados para simulação DEA
. save data_sfa, replace
{txt}file data_sfa.dta saved

{com}. 
. /*
> gera logaritmo das variáveis para a função de produção Cobb-Douglas
> 
> */
. gen l_rec = log(recm)
{txt}
{com}. gen l_cust = log(custm)
{txt}
{com}. gen l_avg = log(avgm)
{txt}
{com}. 
. // define inputs e outputs da análise SFA
. global inp l_cust l_rec
{txt}
{com}. global out l_avg
{txt}
{com}. 
. * variáveis explicativas
. global reglist npp tarm dEtapa2 dEtapa3 ext
{txt}
{com}. 
. ********************************************************************************************
. * Testa se o modelo especificado é válido antes de proceder com as estimativas
. * Foi utilizado o teste do terceiro momento do resíduo OLS (M3T) de Coelli (1995)
. * para checar se os resíduos são assimétricos para a esquerda, o que confirmaria
. * a possibilidade de ser utilizada a especificação para a função de produção. 
. * Para uma função de produção de fronteira estocástica, o erro composto(v - u), u > 0 e v
. * distribuído simetricamente em torno de zero, deve ter os resíduos da estimatica OLS
. * enviesadas para a esquerda. 
. ********************************************************************************************
. reg $out $inp

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 18)        = {res}     0.71
{txt}       Model {c |} {res} .013145006         2  .006572503   {txt}Prob > F        ={res}    0.5067
{txt}    Residual {c |} {res} .167518403        18  .009306578   {txt}R-squared       ={res}    0.0728
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0303
{txt}       Total {c |} {res} .180663408        20   .00903317   {txt}Root MSE        =   {res} .09647

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0336523{col 26}{space 2} .0473419{col 37}{space 1}   -0.71{col 46}{space 3}0.486{col 54}{space 4}-.1331139{col 67}{space 3} .0658093
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0395258{col 26}{space 2} .0358908{col 37}{space 1}    1.10{col 46}{space 3}0.285{col 54}{space 4}-.0358781{col 67}{space 3} .1149297
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.321686{col 26}{space 2} .1756892{col 37}{space 1}    7.52{col 46}{space 3}0.000{col 54}{space 4} .9525771{col 67}{space 3} 1.690796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict e, residual
{txt}
{com}. sum e, detail

                          {txt}Residuals
{hline 61}
      Percentiles      Smallest
 1%    {res}-.2426055      -.2426055
{txt} 5%    {res}-.1241298      -.1241298
{txt}10%    {res}-.0845446      -.0845446       {txt}Obs         {res}         21
{txt}25%    {res}-.0576841      -.0617275       {txt}Sum of Wgt. {res}         21

{txt}50%    {res}-.0001136                      {txt}Mean          {res}-6.02e-10
                        {txt}Largest       Std. Dev.     {res} .0915201
{txt}75%    {res} .0673245        .098525
{txt}90%    {res}  .100082        .100082       {txt}Variance      {res} .0083759
{txt}95%    {res} .1187358       .1187358       {txt}Skewness      {res}-.6730419
{txt}99%    {res} .1353063       .1353063       {txt}Kurtosis      {res} 3.470593
{txt}
{com}. sktest e, noadj
{res}
{txt}Skewness and kurtosis tests for normality
{col 58}{hline 3} Joint test {hline 3}
{col 5}Variable {c |}{col 22}Obs   Pr(skewness)   Pr(kurtosis)   chi2(2)  Prob>chi2
{hline 13}{c +}{hline 61}
           e {c |}{res}{col 16}       21{col 34}0.1402{col 49}0.2716{col 56}     3.38{col 70}0.1841
{txt}
{com}. * notar que a distribuição é assimétrica para a esquerda (Skewness < 0)
. quietly sum e
{txt}
{com}. local e_mean = r(mean)
{txt}
{com}. local N = r(N)
{txt}
{com}. egen double m2 = mean((e - `e_mean')^2)
{txt}
{com}. egen double m3 = mean((e - `e_mean')^3)
{txt}
{com}. gen double M3T = m3/sqrt(6*((m2)^3)/`N')
{txt}
{com}. di "Como ", M3T[1], " é negativo, então os resíduos são assimétricos para a esquerda (rejeição de H0: não há assimetria). "
{res}Como  -1.2591461  é negativo, então os resíduos são assimétricos para a esquerda (rejeição de H0: não há assimetria). 
{txt}
{com}. 
. 
. *********************************************************************************************
. // (1) OLS - Fronteira determinística
. reg $out $inp 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 18)        = {res}     0.71
{txt}       Model {c |} {res} .013145006         2  .006572503   {txt}Prob > F        ={res}    0.5067
{txt}    Residual {c |} {res} .167518403        18  .009306578   {txt}R-squared       ={res}    0.0728
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0303
{txt}       Total {c |} {res} .180663408        20   .00903317   {txt}Root MSE        =   {res} .09647

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0336523{col 26}{space 2} .0473419{col 37}{space 1}   -0.71{col 46}{space 3}0.486{col 54}{space 4}-.1331139{col 67}{space 3} .0658093
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0395258{col 26}{space 2} .0358908{col 37}{space 1}    1.10{col 46}{space 3}0.285{col 54}{space 4}-.0358781{col 67}{space 3} .1149297
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.321686{col 26}{space 2} .1756892{col 37}{space 1}    7.52{col 46}{space 3}0.000{col 54}{space 4} .9525771{col 67}{space 3} 1.690796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo OLS
{txt}
{com}. 
. esttab OLS using "sfaolsest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfaolsest.tex"'})

{com}. 
. predict e_ols, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_ols /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eff_ols = exp(e_ols)
{txt}
{com}. summarize eff_ols

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}         21    1.003918     .089346    .784581   1.144887
{txt}
{com}. 
. *********************************************************************************************
. // (2) COLS - Fronteira determinística (OLS Corrigido)
. reg $out $inp 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 18)        = {res}     0.71
{txt}       Model {c |} {res} .013145006         2  .006572503   {txt}Prob > F        ={res}    0.5067
{txt}    Residual {c |} {res} .167518403        18  .009306578   {txt}R-squared       ={res}    0.0728
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0303
{txt}       Total {c |} {res} .180663408        20   .00903317   {txt}Root MSE        =   {res} .09647

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0336523{col 26}{space 2} .0473419{col 37}{space 1}   -0.71{col 46}{space 3}0.486{col 54}{space 4}-.1331139{col 67}{space 3} .0658093
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0395258{col 26}{space 2} .0358908{col 37}{space 1}    1.10{col 46}{space 3}0.285{col 54}{space 4}-.0358781{col 67}{space 3} .1149297
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.321686{col 26}{space 2} .1756892{col 37}{space 1}    7.52{col 46}{space 3}0.000{col 54}{space 4} .9525771{col 67}{space 3} 1.690796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo COLS
{txt}
{com}. 
. esttab COLS using "sfacolsest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfacolsest.tex"'})

{com}. 
. 
. predict e_cols, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_cols /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double u_star = -(e_cols - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_cols = exp(-u_star) /* calcula eficiência técnica */
{txt}
{com}. summarize eff_cols

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eff_cols {c |}{res}         21    .8768701    .0780392    .685291          1
{txt}
{com}. list conc u_star eff_cols
{txt}
     {c TLC}{hline 17}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}           conc      u_star    eff_cols {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} AUTOFERNAODIAS   .25943605   .77148654 {txt}{c |}
  2. {c |} {res} AUTOFLUMINENSE   .13255447   .87585522 {txt}{c |}
  3. {c |} {res} AUTOLITORALSUL   .14635712   .86384915 {txt}{c |}
  4. {c |} {res}AUTOPLANALTOSUL   .19299034   .82448994 {txt}{c |}
  5. {c |} {res}      AUTOREGIS   .03522427   .96538889 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}       CCRPONTE   .15179756   .85916219 {txt}{c |}
  7. {c |} {res}       CONCEBRA   .18955459   .82732755 {txt}{c |}
  8. {c |} {res}        CONCEPA   .37791175   .68529098 {txt}{c |}
  9. {c |} {res}         CONCER   .15698479   .85471706 {txt}{c |}
 10. {c |} {res}            CRO    .0367813   .96388691 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 11. {c |} {res}            CRT   .13541988   .87334914 {txt}{c |}
 12. {c |} {res}         ECO101   .21985086   .80263849 {txt}{c |}
 13. {c |} {res}       ECOPONTE   .01657043   .98356611 {txt}{c |}
 14. {c |} {res}         ECOSUL    .1305779   .87758812 {txt}{c |}
 15. {c |} {res}    MGORODOVIAS   .08081083   .92236816 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 16. {c |} {res}          MSVIA   .19703372   .82116294 {txt}{c |}
 17. {c |} {res}      NOVADUTRA   .06798176   .93427752 {txt}{c |}
 18. {c |} {res}   RODOVIADOACO           0           1 {txt}{c |}
 19. {c |} {res}TRANSBRASILIANA   .04554307   .95547844 {txt}{c |}
 20. {c |} {res}         VIA040   .07304262   .92956121 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 21. {c |} {res}       VIABAHIA   .19500804   .82282804 {txt}{c |}
     {c BLC}{hline 17}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. 
. *********************************************************************************************
. * (3) CMAD - Corrected Mean absolute Deviation 
. qreg $out $inp /* regressão quantílica - utiliza a mediana */
{txt}Iteration  1:  WLS sum of weighted deviations = {res} .73159192

{txt}Iteration  1: sum of abs. weighted deviations = {res} .73190012
{txt}Iteration  2: sum of abs. weighted deviations = {res} .72797012

{txt}Median regression{col 53}Number of obs = {res}        21
{txt}  Raw sum of deviations{res} .8023613{txt} (about {res}1.3862944{txt})
  Min sum of deviations{res} .7279701{col 53}{txt}Pseudo R2     = {res}    0.0927

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0422098{col 26}{space 2} .0833144{col 37}{space 1}   -0.51{col 46}{space 3}0.619{col 54}{space 4}-.2172468{col 67}{space 3} .1328272
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2}  .046818{col 26}{space 2} .0631623{col 37}{space 1}    0.74{col 46}{space 3}0.468{col 54}{space 4}-.0858811{col 67}{space 3} .1795172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.32528{col 26}{space 2} .3091859{col 37}{space 1}    4.29{col 46}{space 3}0.000{col 54}{space 4} .6757045{col 67}{space 3} 1.974855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo CMAD
{txt}
{com}. 
. esttab CMAD using "sfacmadest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfacmadest.tex"'})

{com}. 
. estout CMAD, style(tex)
{res}
            &        CMAD\\
            &           b\\
l_cust      &   -.0422098\\
l_rec       &     .046818\\
_cons       &     1.32528\\
{txt}
{com}. 
. predict e_cmad, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_cmad /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_star_q = -(e_cmad - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_cmad = exp(-eta_star_q) /* calcula eficiência técnica */
{txt}
{com}. 
. 
. *********************************************************************************************
. * (4) Cobb-Douglas Half-Normal Model
. frontier $out $inp 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:  21.76362}  (not concave)
Iteration 1:{space 3}log likelihood = {res: 22.037521}  
Iteration 2:{space 3}log likelihood = {res: 22.220589}  
Iteration 3:{space 3}log likelihood = {res: 22.353624}  (not concave)
Iteration 4:{space 3}log likelihood = {res: 22.588168}  
Iteration 5:{space 3}log likelihood = {res: 23.025718}  
Iteration 6:{space 3}log likelihood = {res:  23.21679}  
Iteration 7:{space 3}log likelihood = {res: 23.346657}  
Iteration 8:{space 3}log likelihood = {res: 23.417548}  
Iteration 9:{space 3}log likelihood = {res: 23.462199}  
Iteration 10:{space 2}log likelihood = {res: 23.473192}  
Iteration 11:{space 2}log likelihood = {res: 23.483018}  
Iteration 12:{space 2}log likelihood = {res: 23.491162}  
Iteration 13:{space 2}log likelihood = {res: 23.494238}  
Iteration 14:{space 2}log likelihood = {res: 23.496076}  
Iteration 15:{space 2}log likelihood = {res: 23.497236}  
Iteration 16:{space 2}log likelihood = {res: 23.523205}  
Iteration 17:{space 2}log likelihood = {res: 23.523605}  
Iteration 18:{space 2}log likelihood = {res: 23.523982}  
Iteration 19:{space 2}log likelihood = {res: 23.524191}  
Iteration 20:{space 2}log likelihood = {res: 23.524326}  
Iteration 21:{space 2}log likelihood = {res: 23.524382}  
Iteration 22:{space 2}log likelihood = {res: 23.524445}  
Iteration 23:{space 2}log likelihood = {res:  23.52448}  
Iteration 24:{space 2}log likelihood = {res: 23.524495}  (not concave)
Iteration 25:{space 2}log likelihood = {res: 23.524498}  
Iteration 26:{space 2}log likelihood = {res: 23.524502}  
Iteration 27:{space 2}log likelihood = {res: 23.524506}  (not concave)
Iteration 28:{space 2}log likelihood = {res: 23.524507}  
Iteration 29:{space 2}log likelihood = {res:  23.52451}  (not concave)
Iteration 30:{space 2}log likelihood = {res:  23.52451}  
Iteration 31:{space 2}log likelihood = {res: 23.524513}  (not concave)
Iteration 32:{space 2}log likelihood = {res: 23.524513}  
{res}
{txt}Stoc. frontier normal/half-normal model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(1)}{col 67}=          {res}.
{txt}Log likelihood = {res} 23.524513{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0891079{col 26}{space 2} .0739688{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4} -.234084{col 67}{space 3} .0558683
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0747081{col 26}{space 2} .0551096{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4}-.0333048{col 67}{space 3}  .182721
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.600201{col 26}{space 2} .1408171{col 37}{space 1}   11.36{col 46}{space 3}0.000{col 54}{space 4} 1.324205{col 67}{space 3} 1.876197
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2v {c |}{col 14}{res}{space 2}-36.06429{col 26}{space 2} 762.9641{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-1531.446{col 67}{space 3} 1459.318
{txt}    /lnsig2u {c |}{col 14}{res}{space 2}-3.692012{col 26}{space 2} .3086069{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-4.296871{col 67}{space 3}-3.087154
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} 1.47e-08{col 26}{space 2} 5.63e-06{col 54}{space 4}        0{col 67}{space 3}        .
{txt}     sigma_u {c |}{col 14}{res}{space 2} .1578664{col 26}{space 2} .0243593{col 54}{space 4} .1166666{col 67}{space 3} .2136156
{txt}      sigma2 {c |}{col 14}{res}{space 2} .0249218{col 26}{space 2}  .007691{col 54}{space 4} .0098476{col 67}{space 3}  .039996
{txt}      lambda {c |}{col 14}{res}{space 2} 1.07e+07{col 26}{space 2} .0243593{col 54}{space 4} 1.07e+07{col 67}{space 3} 1.07e+07
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}5.19{col 56}{txt}Prob >= chibar2 = {res}0.011
{txt}
{com}. eststo sfa_hn
{txt}
{com}. 
. esttab sfa_hn using "sfa_hnest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_hnest.tex"'})

{com}. 
. predict e_hn, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_hn /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_hn= -(e_hn - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_hn = exp(-eta_hn) /* calcula eficiência técnica */
{txt}
{com}. 
. 
. 
. *********************************************************************************************
. * (5) Cobb-Douglas Exponential Model
. frontier $out $inp, distribution(exponential) 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: 21.607845}  
Iteration 1:{space 3}log likelihood = {res: 21.700348}  
Iteration 2:{space 3}log likelihood = {res: 21.701391}  
Iteration 3:{space 3}log likelihood = {res: 21.701391}  
{res}
{txt}Stoc. frontier normal/exponential model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}      2.75
{txt}Log likelihood = {res} 21.701391{txt}{col 49}Prob > chi2{col 67}= {res}    0.2532

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0268575{col 26}{space 2} .0382039{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.1017359{col 67}{space 3} .0480208
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0410484{col 26}{space 2}  .029511{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.0167921{col 67}{space 3} .0988889
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.330706{col 26}{space 2} .1424451{col 37}{space 1}    9.34{col 46}{space 3}0.000{col 54}{space 4} 1.051519{col 67}{space 3} 1.609894
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2v {c |}{col 14}{res}{space 2}-5.593316{col 26}{space 2} .6492997{col 37}{space 1}   -8.61{col 46}{space 3}0.000{col 54}{space 4} -6.86592{col 67}{space 3}-4.320712
{txt}    /lnsig2u {c |}{col 14}{res}{space 2}-5.438704{col 26}{space 2} .9605757{col 37}{space 1}   -5.66{col 46}{space 3}0.000{col 54}{space 4}-7.321397{col 67}{space 3} -3.55601
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} .0610136{col 26}{space 2} .0198081{col 54}{space 4} .0322912{col 67}{space 3} .1152841
{txt}     sigma_u {c |}{col 14}{res}{space 2} .0659175{col 26}{space 2} .0316594{col 54}{space 4} .0257145{col 67}{space 3} .1689749
{txt}      sigma2 {c |}{col 14}{res}{space 2} .0080678{col 26}{space 2}  .003324{col 54}{space 4} .0015528{col 67}{space 3} .0145827
{txt}      lambda {c |}{col 14}{res}{space 2} 1.080373{col 26}{space 2} .0464102{col 54}{space 4} .9894107{col 67}{space 3} 1.171335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}1.54{col 56}{txt}Prob >= chibar2 = {res}0.107
{txt}
{com}. eststo sfa_exp
{txt}
{com}. 
. esttab sfa_exp using "sfa_expest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_expest.tex"'})

{com}. 
. predict e_exp, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_exp /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_exp= -(e_exp - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_exp = exp(-eta_exp) /* calcula eficiência técnica */
{txt}
{com}. 
. /* não converge!!!!
> *********************************************************************************************
> * (6) Cobb-Douglas Trucated Normal
> frontier $out $inp, distribution(tnormal) cm($reglist)
> eststo sfa_exp
> 
> predict e_exp, u /* salva o resíduo da estimativa OLS na variável e */
> quietly summarize e_exp /* obtém as estatísticas sem imprimir nada na tela */
> gen double eta_exp= -(e_exp - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
> gen double eff_exp = exp(-eta_exp) /* calcula eficiência técnica */
> 
> */
. 
. *********************************************************************************************
. * (7) Cobb-Douglas Half-Normal Model - com variáveis explicativas (uhet)
. *
. * Estimador da matrix de variância-covariância (vce) do tipo "clustered sandwich estimator",
. * assumindo que as observações entre os grupos são inpendentes, porém dentro dos grupos
. * pode não haver independência. 
. frontier $out $inp, uhet($reglist) vce(cluster etp)  
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:  21.76362}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: 25.451614}  (not concave)
Iteration 2:{space 3}log pseudolikelihood = {res:  25.79002}  
Iteration 3:{space 3}log pseudolikelihood = {res: 25.831939}  (backed up)
Iteration 4:{space 3}log pseudolikelihood = {res: 25.933791}  
Iteration 5:{space 3}log pseudolikelihood = {res: 25.947954}  
Iteration 6:{space 3}log pseudolikelihood = {res: 26.058668}  (not concave)
Iteration 7:{space 3}log pseudolikelihood = {res: 26.429799}  (not concave)
Iteration 8:{space 3}log pseudolikelihood = {res: 26.859133}  
Iteration 9:{space 3}log pseudolikelihood = {res: 27.103946}  (not concave)
Iteration 10:{space 2}log pseudolikelihood = {res: 27.613692}  
Iteration 11:{space 2}log pseudolikelihood = {res: 27.664935}  
Iteration 12:{space 2}log pseudolikelihood = {res: 27.877635}  
Iteration 13:{space 2}log pseudolikelihood = {res: 27.894945}  
Iteration 14:{space 2}log pseudolikelihood = {res: 27.935398}  
Iteration 15:{space 2}log pseudolikelihood = {res: 27.953216}  
Iteration 16:{space 2}log pseudolikelihood = {res: 27.967226}  
Iteration 17:{space 2}log pseudolikelihood = {res: 27.971981}  
Iteration 18:{space 2}log pseudolikelihood = {res:  27.97572}  
Iteration 19:{space 2}log pseudolikelihood = {res: 27.976922}  
Iteration 20:{space 2}log pseudolikelihood = {res: 27.978132}  
Iteration 21:{space 2}log pseudolikelihood = {res: 27.978579}  
Iteration 22:{space 2}log pseudolikelihood = {res: 27.978968}  
Iteration 23:{space 2}log pseudolikelihood = {res: 27.979258}  
Iteration 24:{space 2}log pseudolikelihood = {res: 27.979435}  
Iteration 25:{space 2}log pseudolikelihood = {res: 27.979467}  
Iteration 26:{space 2}log pseudolikelihood = {res: 27.979534}  
Iteration 27:{space 2}log pseudolikelihood = {res: 27.979547}  
Iteration 28:{space 2}log pseudolikelihood = {res: 27.979559}  
Iteration 29:{space 2}log pseudolikelihood = {res: 27.979573}  
Iteration 30:{space 2}log pseudolikelihood = {res: 27.979582}  
Iteration 31:{space 2}log pseudolikelihood = {res: 27.979587}  
Iteration 32:{space 2}log pseudolikelihood = {res: 27.979591}  
Iteration 33:{space 2}log pseudolikelihood = {res: 27.979593}  
{res}
{txt}Stoc. frontier normal/half-normal model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(0)}{col 67}=          {res}.
{txt}Log pseudolikelihood = {res} 27.979593{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{ralign 78:(Std. Err. adjusted for {res:3} clusters in etp)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}l_avg        {txt}{c |}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.1058696{col 26}{space 2} 5.26e-09{col 37}{space 1}-2.0e+07{col 46}{space 3}0.000{col 54}{space 4}-.1058697{col 67}{space 3}-.1058696
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0871963{col 26}{space 2} 3.06e-09{col 37}{space 1} 2.8e+07{col 46}{space 3}0.000{col 54}{space 4} .0871963{col 67}{space 3} .0871963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.632111{col 26}{space 2} 1.61e-08{col 37}{space 1} 1.0e+08{col 46}{space 3}0.000{col 54}{space 4} 1.632111{col 67}{space 3} 1.632111
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2v      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-37.72178{col 26}{space 2} .2888757{col 37}{space 1} -130.58{col 46}{space 3}0.000{col 54}{space 4}-38.28796{col 67}{space 3}-37.15559
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2u      {txt}{c |}
{space 9}npp {c |}{col 14}{res}{space 2} 1.244375{col 26}{space 2} .7237922{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.1742314{col 67}{space 3} 2.662982
{txt}{space 8}tarm {c |}{col 14}{res}{space 2} .1502911{col 26}{space 2} .1143763{col 37}{space 1}    1.31{col 46}{space 3}0.189{col 54}{space 4}-.0738823{col 67}{space 3} .3744645
{txt}{space 5}dEtapa2 {c |}{col 14}{res}{space 2}-2.341324{col 26}{space 2} .5367061{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-3.393249{col 67}{space 3}-1.289399
{txt}{space 5}dEtapa3 {c |}{col 14}{res}{space 2}-4.129736{col 26}{space 2} 1.560469{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4}-7.188198{col 67}{space 3}-1.071273
{txt}{space 9}ext {c |}{col 14}{res}{space 2}-.0061018{col 26}{space 2} .0045441{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4} -.015008{col 67}{space 3} .0028044
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.713997{col 26}{space 2} 1.905657{col 37}{space 1}   -3.52{col 46}{space 3}0.000{col 54}{space 4}-10.44902{col 67}{space 3}-2.978977
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} 6.44e-09{col 26}{space 2} 9.30e-10{col 54}{space 4} 4.85e-09{col 67}{space 3} 8.55e-09
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo sfa_hn_ex
{txt}
{com}. 
. esttab sfa_hn_ex using "sfa_hn_exest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_hn_exest.tex"'})

{com}. 
. predict e_hnx, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_hnx /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_hnx= -(e_hnx - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_hnx = exp(-eta_hnx) /* calcula eficiência técnica */
{txt}
{com}. 
. 
. *
. *********************************************************************************************
. * (8) Cobb-Douglas Exponential Model- com variáveis explicativas (uhet)
. *
. *  Como o modelo aceita somente uma variável explicativa, foi escolhida a extensão, na
. * medida que estão sendo utilizadas as receitas e custos sem ser por km
. frontier $out $inp, distribution(exponential) uhet(npp tarm ext) vce(cluster etp) 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res: 21.607845}  
Iteration 1:{space 3}log pseudolikelihood = {res:  22.77516}  (not concave)
Iteration 2:{space 3}log pseudolikelihood = {res:  23.80151}  
Iteration 3:{space 3}log pseudolikelihood = {res:  24.75594}  
Iteration 4:{space 3}log pseudolikelihood = {res: 24.994202}  
Iteration 5:{space 3}log pseudolikelihood = {res: 25.006515}  (backed up)
Iteration 6:{space 3}log pseudolikelihood = {res:  25.00728}  (backed up)
Iteration 7:{space 3}log pseudolikelihood = {res: 25.007662}  (backed up)
Iteration 8:{space 3}log pseudolikelihood = {res: 25.007853}  (backed up)
Iteration 9:{space 3}log pseudolikelihood = {res: 25.007949}  (backed up)
Iteration 10:{space 2}log pseudolikelihood = {res: 25.007973}  (backed up)
Iteration 11:{space 2}log pseudolikelihood = {res: 25.007985}  (backed up)
Iteration 12:{space 2}log pseudolikelihood = {res:  25.00799}  (backed up)
Iteration 13:{space 2}log pseudolikelihood = {res: 25.007991}  (backed up)
Iteration 14:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 15:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 16:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 17:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 18:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 19:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 20:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 21:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 22:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 23:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 24:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 25:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 26:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 27:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 28:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 29:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 30:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 31:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 32:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 33:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 34:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 35:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 36:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 37:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 38:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 39:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 40:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 41:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 42:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 43:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 44:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 45:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 46:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 47:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 48:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 49:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 50:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 51:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 52:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 53:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 54:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 55:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 56:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 57:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 58:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 59:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 60:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 61:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 62:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 63:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 64:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 65:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 66:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 67:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 68:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 69:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 70:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 71:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 72:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 73:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 74:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 75:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 76:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 77:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 78:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 79:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 80:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 81:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 82:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 83:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 84:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 85:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 86:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 87:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 88:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 89:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 90:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 91:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 92:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 93:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 94:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 95:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 96:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 97:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 98:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 99:{space 2}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 100:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 101:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 102:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 103:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 104:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 105:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 106:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 107:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 108:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 109:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 110:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 111:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 112:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 113:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 114:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 115:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 116:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 117:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 118:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 119:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 120:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 121:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 122:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 123:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 124:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 125:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 126:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 127:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 128:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 129:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 130:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 131:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 132:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 133:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 134:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 135:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 136:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 137:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 138:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 139:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 140:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 141:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 142:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 143:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 144:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 145:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 146:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 147:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 148:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 149:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 150:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 151:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 152:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 153:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 154:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 155:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 156:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 157:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 158:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 159:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 160:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 161:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 162:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 163:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 164:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 165:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 166:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 167:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 168:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 169:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 170:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 171:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 172:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 173:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 174:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 175:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 176:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 177:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 178:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 179:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 180:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 181:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 182:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 183:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 184:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 185:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 186:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 187:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 188:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 189:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 190:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 191:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 192:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 193:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 194:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 195:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 196:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 197:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 198:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 199:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 200:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 201:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 202:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 203:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 204:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 205:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 206:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 207:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 208:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 209:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 210:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 211:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 212:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 213:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 214:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 215:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 216:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 217:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 218:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 219:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 220:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 221:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 222:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 223:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 224:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 225:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 226:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 227:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 228:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 229:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 230:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 231:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 232:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 233:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 234:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 235:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 236:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 237:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 238:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 239:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 240:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 241:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 242:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 243:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 244:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 245:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 246:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 247:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 248:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 249:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 250:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 251:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 252:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 253:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 254:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 255:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 256:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 257:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 258:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 259:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 260:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 261:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 262:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 263:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 264:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 265:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 266:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 267:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 268:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 269:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 270:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 271:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 272:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 273:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 274:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 275:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 276:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 277:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 278:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 279:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 280:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 281:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 282:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 283:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 284:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 285:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 286:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 287:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 288:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 289:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 290:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 291:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 292:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 293:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 294:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 295:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 296:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 297:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 298:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 299:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
Iteration 300:{space 1}log pseudolikelihood = {res: 25.007992}  (backed up)
{err}convergence not achieved
{res}
{txt}Stoc. frontier normal/exponential model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(0)}{col 67}=          {res}.
{txt}Log pseudolikelihood = {res} 25.007992{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{ralign 78:(Std. Err. adjusted for {res:3} clusters in etp)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}l_avg        {txt}{c |}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0270266{col 26}{space 2}  .015742{col 37}{space 1}   -1.72{col 46}{space 3}0.086{col 54}{space 4}-.0578802{col 67}{space 3} .0038271
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0452151{col 26}{space 2} .0117219{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} .0222407{col 67}{space 3} .0681896
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.26371{col 26}{space 2}  .123951{col 37}{space 1}   10.20{col 46}{space 3}0.000{col 54}{space 4} 1.020771{col 67}{space 3} 1.506649
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2v      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-5.320834{col 26}{space 2} .3002207{col 37}{space 1}  -17.72{col 46}{space 3}0.000{col 54}{space 4}-5.909256{col 67}{space 3}-4.732412
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2u      {txt}{c |}
{space 9}npp {c |}{col 14}{res}{space 2} 2.456554{col 26}{space 2} 1.112007{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .2770597{col 67}{space 3} 4.636047
{txt}{space 8}tarm {c |}{col 14}{res}{space 2} .4769921{col 26}{space 2} .1210853{col 37}{space 1}    3.94{col 46}{space 3}0.000{col 54}{space 4} .2396693{col 67}{space 3} .7143149
{txt}{space 9}ext {c |}{col 14}{res}{space 2}-.0232353{col 26}{space 2} .0121378{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4} -.047025{col 67}{space 3} .0005544
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-13.99518{col 26}{space 2} 3.348191{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-20.55751{col 67}{space 3}-7.432846
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} .0699191{col 26}{space 2} .0104956{col 54}{space 4}  .052098{col 67}{space 3}  .093836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{err}convergence not achieved
{txt}{search r(430), local:r(430);}

end of do-file

{search r(430), local:r(430);}

{com}. do "C:\Users\carlo\AppData\Local\Temp\STD640_000000.tmp"
{txt}
{com}. *! Version 2021.02.23
. ********************************************************************************
. * Author: Carlos Eduardo Veras Neves                                                                       *
. *                                                                              *
. * Estimation of Technical Efficiency with SFA and DEA for Brazilian            *
. * Federal Toll Road Concessions 
. *                                                                              *
. ********************************************************************************
. * configuração inicial
. set trace off
{txt}
{com}. 
. clear all
{res}{txt}
{com}. 
. set more off
{txt}
{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}