{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Google Drive\_DOUTORADO\__TESE\__CODEandDATA\__TESE_code-data\efficiency\Stata\SFA\logSFA. 5 Mar 202120_12_39.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Mar 2021, 20:12:39
{txt}
{com}. 
. /************************************************************************
> (3) ANÁLISE SFA, TOMANDO COMO VARIÁVEIS:
> - INPUTS: REC; CUST;
> - OUTPUTS: AVG 
> 
> OUTPUT ORIENTED
> *************************************************************************/
. * set the directory to the location of .ado files 
. * .ado files from:
. *
. * A Practitioner's Guide to Stochastic Frontier Analysis Using Stata         
. * Subal C. Kumbhakar, Hung-Jen Wang and Alan P. Horncastle                     
. *                                                                               
. //adopath ++ "C:\ado\personal\sfbook\sfbook_ado"
. 
. // apaga qualquer unidade que tenha valor de receita ou custo nulo 
. //drop if rec  <=0 
. //drop if cust <=0
. 
. /*
> subsititui os id's originais por id's para dados em painel (um id para cada concessionária)
> */
. // lista de concessionárias na base de dados 
. levelsof conc, local(concs)
{res}{txt}`"AUTOFERNAODIAS"' `"AUTOFLUMINENSE"' `"AUTOLITORALSUL"' `"AUTOPLANALTOSUL"' `"AUTOREGIS"' `"CCRPONTE"' `"CONCEBRA"' `"CONCEPA"' `"CONCER"' `"CRO"' `"CRT"' `"ECO101"' `"ECOPONTE"' `"ECOSUL"' `"MGORODOVIAS"' `"MSVIA"' `"NOVADUTRA"' `"RODOVIADOACO"' `"TRANSBRASILIANA"' `"VIA040"' `"VIABAHIA"'

{com}. // contador local para gerar id
. local count 1
{txt}
{com}. // loop na lista de concessionárias
. foreach v in `concs'{c -(}
{txt}  2{com}.         
.         // substitui o id original, para os casos em que há match entre o nome da
.         // concessionária na base e na lista de nomes 
.         quietly replace id = `count' if conc == "`v'"
{txt}  3{com}.         local ++count // atualiza o contador de id
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // gera variáveis dummy para marcar as etapas
. quietly gen dEtapa2 = (etp==2)
{txt}
{com}. quietly gen dEtapa3 = (etp==3)
{txt}
{com}. 
. // Como a análise na parte (1) indicou não haver variação relevante nas variáveis ao longo do tempo, optou-se por calcular as médias do período das variáveis de input e output
. quietly bysort id: egen custm = mean(cust_km_adj)
{txt}
{com}. quietly bysort id: egen recm = mean(rec_km_adj)
{txt}
{com}. quietly bysort id: egen avgm = mean(avg)
{txt}
{com}. quietly bysort id: egen tarm = mean(tar_adj)
{txt}
{com}. // identifica duplicatas
. quietly by id: gen dup = cond(_N==1, 0, _n)
{txt}
{com}. // apaga duplicatas
. drop if dup > 1
{txt}(61 observations deleted)

{com}. 
. // gera índices para as DMUs
. quietly gen dmu = id
{txt}
{com}. 
. // apaga variáveis dispensáveis para a análise DEA
. //quietly drop id ano anoconc cust cust_km rec rec_km avg dup
. 
. // salva dados para simulação DEA
. save data_sfa, replace
{txt}file data_sfa.dta saved

{com}. 
. /*
> gera logaritmo das variáveis para a função de produção Cobb-Douglas
> 
> */
. gen l_rec = log(recm)
{txt}
{com}. gen l_cust = log(custm)
{txt}
{com}. gen l_avg = log(avgm)
{txt}
{com}. 
. // define inputs e outputs da análise SFA
. global inp l_cust l_rec
{txt}
{com}. global out l_avg
{txt}
{com}. 
. * variáveis explicativas
. global reglist npp tarm dEtapa2 dEtapa3 
{txt}
{com}. 
. ********************************************************************************************
. * Testa se o modelo especificado é válido antes de proceder com as estimativas
. * Foi utilizado o teste do terceiro momento do resíduo OLS (M3T) de Coelli (1995)
. * para checar se os resíduos são assimétricos para a esquerda, o que confirmaria
. * a possibilidade de ser utilizada a especificação para a função de produção. 
. * Para uma função de produção de fronteira estocástica, o erro composto(v - u), u > 0 e v
. * distribuído simetricamente em torno de zero, deve ter os resíduos da estimatica OLS
. * enviesadas para a esquerda. 
. ********************************************************************************************
. //reg $out $inp
. reg $out l_cust l_rec npp

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(3, 17)        = {res}     0.74
{txt}       Model {c |} {res} .020804889         3  .006934963   {txt}Prob > F        ={res}    0.5441
{txt}    Residual {c |} {res}  .15985852        17  .009403442   {txt}R-squared       ={res}    0.1152
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0410
{txt}       Total {c |} {res} .180663408        20   .00903317   {txt}Root MSE        =   {res} .09697

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0148946{col 26}{space 2}  .051928{col 37}{space 1}   -0.29{col 46}{space 3}0.778{col 54}{space 4}-.1244531{col 67}{space 3}  .094664
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0046177{col 26}{space 2} .0528915{col 37}{space 1}    0.09{col 46}{space 3}0.931{col 54}{space 4}-.1069736{col 67}{space 3}  .116209
{txt}{space 9}npp {c |}{col 14}{res}{space 2} -.011166{col 26}{space 2} .0123717{col 37}{space 1}   -0.90{col 46}{space 3}0.379{col 54}{space 4}-.0372679{col 67}{space 3}  .014936
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.482379{col 26}{space 2}  .250774{col 37}{space 1}    5.91{col 46}{space 3}0.000{col 54}{space 4} .9532918{col 67}{space 3} 2.011465
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict e, residual
{txt}
{com}. sum e, detail

                          {txt}Residuals
{hline 61}
      Percentiles      Smallest
 1%    {res}-.2423966      -.2423966
{txt} 5%    {res}-.1050643      -.1050643
{txt}10%    {res}-.0852994      -.0852994       {txt}Obs         {res}         21
{txt}25%    {res}-.0558858      -.0724733       {txt}Sum of Wgt. {res}         21

{txt}50%    {res}-.0137215                      {txt}Mean          {res}-4.43e-11
                        {txt}Largest       Std. Dev.     {res} .0894032
{txt}75%    {res} .0767824       .1008322
{txt}90%    {res} .1031574       .1031574       {txt}Variance      {res} .0079929
{txt}95%    {res} .1124005       .1124005       {txt}Skewness      {res}-.7135096
{txt}99%    {res} .1184759       .1184759       {txt}Kurtosis      {res} 3.607638
{txt}
{com}. sktest e, noadj
{res}
{txt}Skewness and kurtosis tests for normality
{col 58}{hline 3} Joint test {hline 3}
{col 5}Variable {c |}{col 22}Obs   Pr(skewness)   Pr(kurtosis)   chi2(2)  Prob>chi2
{hline 13}{c +}{hline 61}
           e {c |}{res}{col 16}       21{col 34}0.1197{col 49}0.2205{col 56}     3.92{col 70}0.1407
{txt}
{com}. 
. qnorm e
{res}{txt}
{com}. kdensity e
{txt}(n() set to 21)
{res}{txt}
{com}. 
. * notar que a distribuição é assimétrica para a esquerda (Skewness < 0)
. quietly sum e
{txt}
{com}. local e_mean = r(mean)
{txt}
{com}. local N = r(N)
{txt}
{com}. egen double m2 = mean((e - `e_mean')^2)
{txt}
{com}. egen double m3 = mean((e - `e_mean')^3)
{txt}
{com}. gen double M3T = m3/sqrt(6*((m2)^3)/`N')
{txt}
{com}. //di "Como ", M3T[1], " é negativo, então os resíduos são assimétricos para a esquerda (rejeição de H0: não há assimetria). "
. di  M3T[1]
{res}-1.3348543
{txt}
{com}. 
. *********************************************************************************************
. // (1) OLS - Fronteira determinística
. reg $out $inp 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 18)        = {res}     0.71
{txt}       Model {c |} {res} .013145006         2  .006572503   {txt}Prob > F        ={res}    0.5067
{txt}    Residual {c |} {res} .167518403        18  .009306578   {txt}R-squared       ={res}    0.0728
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0303
{txt}       Total {c |} {res} .180663408        20   .00903317   {txt}Root MSE        =   {res} .09647

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0336523{col 26}{space 2} .0473419{col 37}{space 1}   -0.71{col 46}{space 3}0.486{col 54}{space 4}-.1331139{col 67}{space 3} .0658093
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0395258{col 26}{space 2} .0358908{col 37}{space 1}    1.10{col 46}{space 3}0.285{col 54}{space 4}-.0358781{col 67}{space 3} .1149297
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.321686{col 26}{space 2} .1756892{col 37}{space 1}    7.52{col 46}{space 3}0.000{col 54}{space 4} .9525771{col 67}{space 3} 1.690796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo OLS
{txt}
{com}. 
. esttab OLS using "sfaolsest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfaolsest.tex"'})

{com}. 
. predict e_ols, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_ols /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eff_ols = exp(e_ols)
{txt}
{com}. summarize eff_ols

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}         21    1.003918     .089346    .784581   1.144887
{txt}
{com}. 
. *********************************************************************************************
. // (2) COLS - Fronteira determinística (OLS Corrigido)
. reg $out $inp 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        21
{txt}{hline 13}{c +}{hline 34}   F(2, 18)        = {res}     0.71
{txt}       Model {c |} {res} .013145006         2  .006572503   {txt}Prob > F        ={res}    0.5067
{txt}    Residual {c |} {res} .167518403        18  .009306578   {txt}R-squared       ={res}    0.0728
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0303
{txt}       Total {c |} {res} .180663408        20   .00903317   {txt}Root MSE        =   {res} .09647

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0336523{col 26}{space 2} .0473419{col 37}{space 1}   -0.71{col 46}{space 3}0.486{col 54}{space 4}-.1331139{col 67}{space 3} .0658093
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0395258{col 26}{space 2} .0358908{col 37}{space 1}    1.10{col 46}{space 3}0.285{col 54}{space 4}-.0358781{col 67}{space 3} .1149297
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.321686{col 26}{space 2} .1756892{col 37}{space 1}    7.52{col 46}{space 3}0.000{col 54}{space 4} .9525771{col 67}{space 3} 1.690796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo COLS
{txt}
{com}. 
. esttab COLS using "sfacolsest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfacolsest.tex"'})

{com}. 
. 
. predict e_cols, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_cols /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double u_star = -(e_cols - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_cols = exp(-u_star) /* calcula eficiência técnica */
{txt}
{com}. summarize eff_cols

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eff_cols {c |}{res}         21    .8768701    .0780392    .685291          1
{txt}
{com}. list conc u_star eff_cols
{txt}
     {c TLC}{hline 17}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}           conc      u_star    eff_cols {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} AUTOFERNAODIAS   .25943605   .77148654 {txt}{c |}
  2. {c |} {res} AUTOFLUMINENSE   .13255447   .87585522 {txt}{c |}
  3. {c |} {res} AUTOLITORALSUL   .14635712   .86384915 {txt}{c |}
  4. {c |} {res}AUTOPLANALTOSUL   .19299034   .82448994 {txt}{c |}
  5. {c |} {res}      AUTOREGIS   .03522427   .96538889 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}       CCRPONTE   .15179756   .85916219 {txt}{c |}
  7. {c |} {res}       CONCEBRA   .18955459   .82732755 {txt}{c |}
  8. {c |} {res}        CONCEPA   .37791175   .68529098 {txt}{c |}
  9. {c |} {res}         CONCER   .15698479   .85471706 {txt}{c |}
 10. {c |} {res}            CRO    .0367813   .96388691 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 11. {c |} {res}            CRT   .13541988   .87334914 {txt}{c |}
 12. {c |} {res}         ECO101   .21985086   .80263849 {txt}{c |}
 13. {c |} {res}       ECOPONTE   .01657043   .98356611 {txt}{c |}
 14. {c |} {res}         ECOSUL    .1305779   .87758812 {txt}{c |}
 15. {c |} {res}    MGORODOVIAS   .08081083   .92236816 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 16. {c |} {res}          MSVIA   .19703372   .82116294 {txt}{c |}
 17. {c |} {res}      NOVADUTRA   .06798176   .93427752 {txt}{c |}
 18. {c |} {res}   RODOVIADOACO           0           1 {txt}{c |}
 19. {c |} {res}TRANSBRASILIANA   .04554307   .95547844 {txt}{c |}
 20. {c |} {res}         VIA040   .07304262   .92956121 {txt}{c |}
     {c LT}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
 21. {c |} {res}       VIABAHIA   .19500804   .82282804 {txt}{c |}
     {c BLC}{hline 17}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. 
. *********************************************************************************************
. * (3) CMAD - Corrected Mean absolute Deviation 
. qreg $out $inp /* regressão quantílica - utiliza a mediana */
{txt}Iteration  1:  WLS sum of weighted deviations = {res} .73159192

{txt}Iteration  1: sum of abs. weighted deviations = {res} .73190012
{txt}Iteration  2: sum of abs. weighted deviations = {res} .72797012

{txt}Median regression{col 53}Number of obs = {res}        21
{txt}  Raw sum of deviations{res} .8023613{txt} (about {res}1.3862944{txt})
  Min sum of deviations{res} .7279701{col 53}{txt}Pseudo R2     = {res}    0.0927

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0422098{col 26}{space 2} .0833144{col 37}{space 1}   -0.51{col 46}{space 3}0.619{col 54}{space 4}-.2172468{col 67}{space 3} .1328272
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2}  .046818{col 26}{space 2} .0631623{col 37}{space 1}    0.74{col 46}{space 3}0.468{col 54}{space 4}-.0858811{col 67}{space 3} .1795172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.32528{col 26}{space 2} .3091859{col 37}{space 1}    4.29{col 46}{space 3}0.000{col 54}{space 4} .6757045{col 67}{space 3} 1.974855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo CMAD
{txt}
{com}. 
. esttab CMAD using "sfacmadest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfacmadest.tex"'})

{com}. 
. estout CMAD, style(tex)
{res}
            &        CMAD\\
            &           b\\
l_cust      &   -.0422098\\
l_rec       &     .046818\\
_cons       &     1.32528\\
{txt}
{com}. 
. predict e_cmad, residual /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_cmad /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_star_q = -(e_cmad - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_cmad = exp(-eta_star_q) /* calcula eficiência técnica */
{txt}
{com}. 
. 
. *********************************************************************************************
. * (4) Cobb-Douglas Half-Normal Model
. frontier $out $inp 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:  21.76362}  (not concave)
Iteration 1:{space 3}log likelihood = {res: 22.037521}  
Iteration 2:{space 3}log likelihood = {res: 22.220589}  
Iteration 3:{space 3}log likelihood = {res: 22.353624}  (not concave)
Iteration 4:{space 3}log likelihood = {res: 22.588168}  
Iteration 5:{space 3}log likelihood = {res: 23.025718}  
Iteration 6:{space 3}log likelihood = {res:  23.21679}  
Iteration 7:{space 3}log likelihood = {res: 23.346657}  
Iteration 8:{space 3}log likelihood = {res: 23.417548}  
Iteration 9:{space 3}log likelihood = {res: 23.462199}  
Iteration 10:{space 2}log likelihood = {res: 23.473192}  
Iteration 11:{space 2}log likelihood = {res: 23.483018}  
Iteration 12:{space 2}log likelihood = {res: 23.491162}  
Iteration 13:{space 2}log likelihood = {res: 23.494238}  
Iteration 14:{space 2}log likelihood = {res: 23.496076}  
Iteration 15:{space 2}log likelihood = {res: 23.497236}  
Iteration 16:{space 2}log likelihood = {res: 23.523205}  
Iteration 17:{space 2}log likelihood = {res: 23.523605}  
Iteration 18:{space 2}log likelihood = {res: 23.523982}  
Iteration 19:{space 2}log likelihood = {res: 23.524191}  
Iteration 20:{space 2}log likelihood = {res: 23.524326}  
Iteration 21:{space 2}log likelihood = {res: 23.524382}  
Iteration 22:{space 2}log likelihood = {res: 23.524445}  
Iteration 23:{space 2}log likelihood = {res:  23.52448}  
Iteration 24:{space 2}log likelihood = {res: 23.524495}  (not concave)
Iteration 25:{space 2}log likelihood = {res: 23.524498}  
Iteration 26:{space 2}log likelihood = {res: 23.524502}  
Iteration 27:{space 2}log likelihood = {res: 23.524506}  (not concave)
Iteration 28:{space 2}log likelihood = {res: 23.524507}  
Iteration 29:{space 2}log likelihood = {res:  23.52451}  (not concave)
Iteration 30:{space 2}log likelihood = {res:  23.52451}  
Iteration 31:{space 2}log likelihood = {res: 23.524513}  (not concave)
Iteration 32:{space 2}log likelihood = {res: 23.524513}  
{res}
{txt}Stoc. frontier normal/half-normal model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(1)}{col 67}=          {res}.
{txt}Log likelihood = {res} 23.524513{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0891079{col 26}{space 2} .0739688{col 37}{space 1}   -1.20{col 46}{space 3}0.228{col 54}{space 4} -.234084{col 67}{space 3} .0558683
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0747081{col 26}{space 2} .0551096{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4}-.0333048{col 67}{space 3}  .182721
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.600201{col 26}{space 2} .1408171{col 37}{space 1}   11.36{col 46}{space 3}0.000{col 54}{space 4} 1.324205{col 67}{space 3} 1.876197
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2v {c |}{col 14}{res}{space 2}-36.06429{col 26}{space 2} 762.9641{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-1531.446{col 67}{space 3} 1459.318
{txt}    /lnsig2u {c |}{col 14}{res}{space 2}-3.692012{col 26}{space 2} .3086069{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-4.296871{col 67}{space 3}-3.087154
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} 1.47e-08{col 26}{space 2} 5.63e-06{col 54}{space 4}        0{col 67}{space 3}        .
{txt}     sigma_u {c |}{col 14}{res}{space 2} .1578664{col 26}{space 2} .0243593{col 54}{space 4} .1166666{col 67}{space 3} .2136156
{txt}      sigma2 {c |}{col 14}{res}{space 2} .0249218{col 26}{space 2}  .007691{col 54}{space 4} .0098476{col 67}{space 3}  .039996
{txt}      lambda {c |}{col 14}{res}{space 2} 1.07e+07{col 26}{space 2} .0243593{col 54}{space 4} 1.07e+07{col 67}{space 3} 1.07e+07
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}5.19{col 56}{txt}Prob >= chibar2 = {res}0.011
{txt}
{com}. eststo sfa_hn
{txt}
{com}. 
. esttab sfa_hn using "sfa_hnest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_hnest.tex"'})

{com}. 
. predict e_hn, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_hn /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_hn= -(e_hn - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_hn = exp(-eta_hn) /* calcula eficiência técnica */
{txt}
{com}. 
. 
. 
. *********************************************************************************************
. * (5) Cobb-Douglas Exponential Model
. frontier $out $inp, distribution(exponential) 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: 21.607845}  
Iteration 1:{space 3}log likelihood = {res: 21.700348}  
Iteration 2:{space 3}log likelihood = {res: 21.701391}  
Iteration 3:{space 3}log likelihood = {res: 21.701391}  
{res}
{txt}Stoc. frontier normal/exponential model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}      2.75
{txt}Log likelihood = {res} 21.701391{txt}{col 49}Prob > chi2{col 67}= {res}    0.2532

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0268575{col 26}{space 2} .0382039{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.1017359{col 67}{space 3} .0480208
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0410484{col 26}{space 2}  .029511{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.0167921{col 67}{space 3} .0988889
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.330706{col 26}{space 2} .1424451{col 37}{space 1}    9.34{col 46}{space 3}0.000{col 54}{space 4} 1.051519{col 67}{space 3} 1.609894
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2v {c |}{col 14}{res}{space 2}-5.593316{col 26}{space 2} .6492997{col 37}{space 1}   -8.61{col 46}{space 3}0.000{col 54}{space 4} -6.86592{col 67}{space 3}-4.320712
{txt}    /lnsig2u {c |}{col 14}{res}{space 2}-5.438704{col 26}{space 2} .9605757{col 37}{space 1}   -5.66{col 46}{space 3}0.000{col 54}{space 4}-7.321397{col 67}{space 3} -3.55601
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} .0610136{col 26}{space 2} .0198081{col 54}{space 4} .0322912{col 67}{space 3} .1152841
{txt}     sigma_u {c |}{col 14}{res}{space 2} .0659175{col 26}{space 2} .0316594{col 54}{space 4} .0257145{col 67}{space 3} .1689749
{txt}      sigma2 {c |}{col 14}{res}{space 2} .0080678{col 26}{space 2}  .003324{col 54}{space 4} .0015528{col 67}{space 3} .0145827
{txt}      lambda {c |}{col 14}{res}{space 2} 1.080373{col 26}{space 2} .0464102{col 54}{space 4} .9894107{col 67}{space 3} 1.171335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}1.54{col 56}{txt}Prob >= chibar2 = {res}0.107
{txt}
{com}. eststo sfa_exp
{txt}
{com}. 
. esttab sfa_exp using "sfa_expest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_expest.tex"'})

{com}. 
. predict e_exp, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_exp /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_exp= -(e_exp - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_exp = exp(-eta_exp) /* calcula eficiência técnica */
{txt}
{com}. 
. /* não converge!!!!
> *********************************************************************************************
> * (6) Cobb-Douglas Trucated Normal
> frontier $out $inp, distribution(tnormal) cm($reglist)
> eststo sfa_exp
> 
> predict e_exp, u /* salva o resíduo da estimativa OLS na variável e */
> quietly summarize e_exp /* obtém as estatísticas sem imprimir nada na tela */
> gen double eta_exp= -(e_exp - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
> gen double eff_exp = exp(-eta_exp) /* calcula eficiência técnica */
> 
> */
. 
. *********************************************************************************************
. * (7) Cobb-Douglas Half-Normal Model - com variáveis explicativas (uhet)
. *
. * Estimador da matrix de variância-covariância (vce) do tipo "clustered sandwich estimator",
. * assumindo que as observações entre os grupos são inpendentes, porém dentro dos grupos
. * pode não haver independência. 
. frontier $out $inp, uhet($reglist) vce(cluster etp)  
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:  21.76362}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: 23.757581}  (not concave)
Iteration 2:{space 3}log pseudolikelihood = {res: 24.201327}  (not concave)
Iteration 3:{space 3}log pseudolikelihood = {res: 24.477524}  (not concave)
Iteration 4:{space 3}log pseudolikelihood = {res: 24.877439}  (not concave)
Iteration 5:{space 3}log pseudolikelihood = {res: 25.410468}  (not concave)
Iteration 6:{space 3}log pseudolikelihood = {res: 25.610801}  
Iteration 7:{space 3}log pseudolikelihood = {res: 26.066874}  
Iteration 8:{space 3}log pseudolikelihood = {res: 26.359105}  
Iteration 9:{space 3}log pseudolikelihood = {res: 26.522799}  
Iteration 10:{space 2}log pseudolikelihood = {res: 26.596451}  
Iteration 11:{space 2}log pseudolikelihood = {res: 26.626273}  
Iteration 12:{space 2}log pseudolikelihood = {res: 26.653114}  
Iteration 13:{space 2}log pseudolikelihood = {res: 26.660229}  
Iteration 14:{space 2}log pseudolikelihood = {res:  26.66692}  
Iteration 15:{space 2}log pseudolikelihood = {res: 26.669532}  
Iteration 16:{space 2}log pseudolikelihood = {res: 26.671146}  
Iteration 17:{space 2}log pseudolikelihood = {res: 26.672633}  
Iteration 18:{space 2}log pseudolikelihood = {res:  26.67287}  
Iteration 19:{space 2}log pseudolikelihood = {res: 26.673096}  
Iteration 20:{space 2}log pseudolikelihood = {res: 26.673344}  
Iteration 21:{space 2}log pseudolikelihood = {res: 26.673462}  
Iteration 22:{space 2}log pseudolikelihood = {res: 26.673541}  
Iteration 23:{space 2}log pseudolikelihood = {res: 26.673593}  
Iteration 24:{space 2}log pseudolikelihood = {res: 26.673634}  
Iteration 25:{space 2}log pseudolikelihood = {res: 26.673662}  
Iteration 26:{space 2}log pseudolikelihood = {res: 26.673675}  
Iteration 27:{space 2}log pseudolikelihood = {res: 26.673685}  
Iteration 28:{space 2}log pseudolikelihood = {res: 26.673697}  
Iteration 29:{space 2}log pseudolikelihood = {res: 26.673699}  
{res}
{txt}Stoc. frontier normal/half-normal model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(0)}{col 67}=          {res}.
{txt}Log pseudolikelihood = {res} 26.673699{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{ralign 78:(Std. Err. adjusted for {res:3} clusters in etp)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}l_avg        {txt}{c |}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.1058696{col 26}{space 2} 1.09e-08{col 37}{space 1}-9.7e+06{col 46}{space 3}0.000{col 54}{space 4}-.1058697{col 67}{space 3}-.1058696
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0871963{col 26}{space 2} 6.29e-09{col 37}{space 1} 1.4e+07{col 46}{space 3}0.000{col 54}{space 4} .0871963{col 67}{space 3} .0871963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.632111{col 26}{space 2} 3.30e-08{col 37}{space 1} 4.9e+07{col 46}{space 3}0.000{col 54}{space 4} 1.632111{col 67}{space 3} 1.632111
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2v      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-36.32107{col 26}{space 2} .2629306{col 37}{space 1} -138.14{col 46}{space 3}0.000{col 54}{space 4} -36.8364{col 67}{space 3}-35.80573
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2u      {txt}{c |}
{space 9}npp {c |}{col 14}{res}{space 2} .4699641{col 26}{space 2} .1918721{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0939017{col 67}{space 3} .8460264
{txt}{space 8}tarm {c |}{col 14}{res}{space 2}  .121886{col 26}{space 2} .1132308{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-.1000423{col 67}{space 3} .3438142
{txt}{space 5}dEtapa2 {c |}{col 14}{res}{space 2}-1.620025{col 26}{space 2}  1.09269{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-3.761658{col 67}{space 3}  .521607
{txt}{space 5}dEtapa3 {c |}{col 14}{res}{space 2}-2.730341{col 26}{space 2} 1.160552{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4} -5.00498{col 67}{space 3}-.4557018
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.748463{col 26}{space 2} 1.282805{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 54}{space 4}-8.262714{col 67}{space 3}-3.234212
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} 1.30e-08{col 26}{space 2} 1.71e-09{col 54}{space 4} 1.00e-08{col 67}{space 3} 1.68e-08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo sfa_hn_ex
{txt}
{com}. 
. esttab sfa_hn_ex using "sfa_hn_exest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_hn_exest.tex"'})

{com}. 
. predict e_hnx, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_hnx /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_hnx= -(e_hnx - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_hnx = exp(-eta_hnx) /* calcula eficiência técnica */
{txt}
{com}. 
. *********************************************************************************************
. * (7) Cobb-Douglas Half-Normal Model - com variáveis explicativas (uhet)
. *
. * Estimador da matrix de variância-covariância (vce) do tipo "clustered sandwich estimator",
. * assumindo que as observações entre os grupos são inpendentes, porém dentro dos grupos
. * pode não haver independência.  (MESMA ESPECIFICAÇÃO DO MODELO EXP_EX)
. 
. frontier $out $inp, uhet(npp tarm) vce(cluster etp)  
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:  21.76362}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: 22.732067}  (not concave)
Iteration 2:{space 3}log pseudolikelihood = {res: 23.050069}  
Iteration 3:{space 3}log pseudolikelihood = {res: 23.538296}  
Iteration 4:{space 3}log pseudolikelihood = {res: 24.081136}  
Iteration 5:{space 3}log pseudolikelihood = {res: 24.536483}  
Iteration 6:{space 3}log pseudolikelihood = {res: 24.722104}  
Iteration 7:{space 3}log pseudolikelihood = {res: 24.861163}  
Iteration 8:{space 3}log pseudolikelihood = {res: 24.895238}  
Iteration 9:{space 3}log pseudolikelihood = {res:  24.92487}  
Iteration 10:{space 2}log pseudolikelihood = {res: 24.950618}  
Iteration 11:{space 2}log pseudolikelihood = {res: 24.952361}  
Iteration 12:{space 2}log pseudolikelihood = {res: 24.964975}  
Iteration 13:{space 2}log pseudolikelihood = {res: 24.965709}  (backed up)
Iteration 14:{space 2}log pseudolikelihood = {res: 24.966692}  
Iteration 15:{space 2}log pseudolikelihood = {res: 24.968016}  
Iteration 16:{space 2}log pseudolikelihood = {res: 24.968224}  
Iteration 17:{space 2}log pseudolikelihood = {res: 24.968423}  
Iteration 18:{space 2}log pseudolikelihood = {res:  24.96866}  
Iteration 19:{space 2}log pseudolikelihood = {res: 24.968749}  
Iteration 20:{space 2}log pseudolikelihood = {res: 24.968845}  
Iteration 21:{space 2}log pseudolikelihood = {res: 24.968886}  
Iteration 22:{space 2}log pseudolikelihood = {res: 24.968919}  
Iteration 23:{space 2}log pseudolikelihood = {res: 24.968941}  
Iteration 24:{space 2}log pseudolikelihood = {res: 24.968958}  
Iteration 25:{space 2}log pseudolikelihood = {res: 24.968971}  
Iteration 26:{space 2}log pseudolikelihood = {res: 24.968977}  
Iteration 27:{space 2}log pseudolikelihood = {res: 24.968981}  
Iteration 28:{space 2}log pseudolikelihood = {res: 24.968985}  
Iteration 29:{space 2}log pseudolikelihood = {res: 24.968987}  
{res}
{txt}Stoc. frontier normal/half-normal model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(0)}{col 67}=          {res}.
{txt}Log pseudolikelihood = {res} 24.968987{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{ralign 78:(Std. Err. adjusted for {res:3} clusters in etp)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}l_avg        {txt}{c |}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.1058696{col 26}{space 2} 7.00e-09{col 37}{space 1}-1.5e+07{col 46}{space 3}0.000{col 54}{space 4}-.1058697{col 67}{space 3}-.1058696
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0871963{col 26}{space 2} 4.08e-09{col 37}{space 1} 2.1e+07{col 46}{space 3}0.000{col 54}{space 4} .0871963{col 67}{space 3} .0871963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.632111{col 26}{space 2} 2.12e-08{col 37}{space 1} 7.7e+07{col 46}{space 3}0.000{col 54}{space 4} 1.632111{col 67}{space 3} 1.632111
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2v      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -37.1944{col 26}{space 2} .3373319{col 37}{space 1} -110.26{col 46}{space 3}0.000{col 54}{space 4}-37.85555{col 67}{space 3}-36.53324
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2u      {txt}{c |}
{space 9}npp {c |}{col 14}{res}{space 2} .1813517{col 26}{space 2} .1225206{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0587842{col 67}{space 3} .4214876
{txt}{space 8}tarm {c |}{col 14}{res}{space 2} .1756853{col 26}{space 2} .0197127{col 37}{space 1}    8.91{col 46}{space 3}0.000{col 54}{space 4}  .137049{col 67}{space 3} .2143216
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -5.89359{col 26}{space 2} .7228233{col 37}{space 1}   -8.15{col 46}{space 3}0.000{col 54}{space 4}-7.310297{col 67}{space 3}-4.476882
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} 8.38e-09{col 26}{space 2} 1.41e-09{col 54}{space 4} 6.02e-09{col 67}{space 3} 1.17e-08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo sfa_hn_ex2
{txt}
{com}. 
. esttab sfa_hn_ex2 using "sfa_hn_ex2est.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_hn_ex2est.tex"'})

{com}. 
. predict e_hnx2, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_hnx2 /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_hnx2= -(e_hnx2 - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_hnx2 = exp(-eta_hnx2) /* calcula eficiência técnica */
{txt}
{com}. 
. *
. *********************************************************************************************
. * (8) Cobb-Douglas Exponential Model- com variáveis explicativas (uhet)
. *
. *  Como o modelo aceita somente uma variável explicativa, foi escolhida a extensão, na
. * medida que estão sendo utilizadas as receitas e custos sem ser por km
. frontier $out $inp, distribution(exponential) uhet(npp tarm ) vce(cluster etp) 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res: 21.607845}  
Iteration 1:{space 3}log pseudolikelihood = {res: 22.519926}  
Iteration 2:{space 3}log pseudolikelihood = {res: 22.556677}  
Iteration 3:{space 3}log pseudolikelihood = {res: 22.701567}  
Iteration 4:{space 3}log pseudolikelihood = {res: 22.704052}  
Iteration 5:{space 3}log pseudolikelihood = {res: 22.704115}  
Iteration 6:{space 3}log pseudolikelihood = {res: 22.704115}  
{res}
{txt}Stoc. frontier normal/exponential model{col 49}Number of obs{col 67}= {res}        21
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(0)}{col 67}=          {res}.
{txt}Log pseudolikelihood = {res} 22.704115{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{ralign 78:(Std. Err. adjusted for {res:3} clusters in etp)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       l_avg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}l_avg        {txt}{c |}
{space 6}l_cust {c |}{col 14}{res}{space 2}-.0423203{col 26}{space 2} .0223804{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.0861851{col 67}{space 3} .0015445
{txt}{space 7}l_rec {c |}{col 14}{res}{space 2} .0519091{col 26}{space 2} .0274553{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4}-.0019023{col 67}{space 3} .1057205
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.343962{col 26}{space 2} .2346276{col 37}{space 1}    5.73{col 46}{space 3}0.000{col 54}{space 4} .8841005{col 67}{space 3} 1.803824
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2v      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -5.33828{col 26}{space 2} .6394759{col 37}{space 1}   -8.35{col 46}{space 3}0.000{col 54}{space 4} -6.59163{col 67}{space 3}-4.084931
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lnsig2u      {txt}{c |}
{space 9}npp {c |}{col 14}{res}{space 2} .2562408{col 26}{space 2} .2316856{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4}-.1978546{col 67}{space 3} .7103362
{txt}{space 8}tarm {c |}{col 14}{res}{space 2} .3530081{col 26}{space 2} .4405403{col 37}{space 1}    0.80{col 46}{space 3}0.423{col 54}{space 4}-.5104351{col 67}{space 3} 1.216451
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-10.14291{col 26}{space 2} 5.232925{col 37}{space 1}   -1.94{col 46}{space 3}0.053{col 54}{space 4}-20.39926{col 67}{space 3} .1134322
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_v {c |}{col 14}{res}{space 2} .0693118{col 26}{space 2} .0221616{col 54}{space 4} .0370378{col 67}{space 3} .1297085
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo sfa_exp_ex
{txt}
{com}. 
. esttab sfa_exp_ex using "sfa_exp_exest.tex" , beta tex replace
{res}{txt}(output written to {browse  `"sfa_exp_exest.tex"'})

{com}. 
. 
. predict e_expx, u /* salva o resíduo da estimativa OLS na variável e */
{txt}
{com}. quietly summarize e_expx /* obtém as estatísticas sem imprimir nada na tela */
{txt}
{com}. gen double eta_expx= -(e_expx - r(max)) /* obtém ineficiência a partir dos resíduos corrigidos */ 
{txt}
{com}. gen double eff_expx = exp(-eta_expx) /* calcula eficiência técnica */
{txt}
{com}. 
. 
. // saída de dados:
. summarize eff_ols eff_cols eff_cmad eff_hn eff_exp eff_hnx eff_hnx2 eff_expx 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}         21    1.003918     .089346    .784581   1.144887
{txt}{space 4}eff_cols {c |}{res}         21    .8768701    .0780392    .685291          1
{txt}{space 4}eff_cmad {c |}{res}         21     .877152    .0781568   .6844466          1
{txt}{space 6}eff_hn {c |}{res}         21    .7918973    .0771395   .6938518          1
{txt}{space 5}eff_exp {c |}{res}         21    .8248471    .0466663   .7882676          1
{txt}{hline 13}{c +}{hline 57}
{space 5}eff_hnx {c |}{res}         21    .7914288     .078948   .6942815          1
{txt}{space 4}eff_hnx2 {c |}{res}         21    .7914288     .078948   .6942815          1
{txt}{space 4}eff_expx {c |}{res}         21    .8246612    .0424217   .7972965          1
{txt}
{com}. 
. esttab using "summary_eff_sfa.tex" , stat(mean sd count) tex replace
{res}{txt}(output written to {browse  `"summary_eff_sfa.tex"'})

{com}. 
. list dmu conc eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp  eff_expx 

     {txt}{c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  1. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  1 {txt}{c |} {res} AUTOFERNAODIAS {txt}{c |} {res}.88326519 {txt}{c |} {res}.77148654 {txt}{c |} {res}.77285913 {txt}{c |} {res}.88815879 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}  .885485    {txt}{c |}    {res}  .885485    {txt}{c |}    {res}.88210062    {txt}{c |}    {res}.82507264    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  2. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  2 {txt}{c |} {res} AUTOFLUMINENSE {txt}{c |} {res}1.0027556 {txt}{c |} {res}.87585522 {txt}{c |} {res} .8796492 {txt}{c |} {res}.76779355 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.76142045    {txt}{c |}    {res}.76142045    {txt}{c |}    {res}.81225002    {txt}{c |}    {res} .8073632    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  3. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  3 {txt}{c |} {res} AUTOLITORALSUL {txt}{c |} {res}.98900997 {txt}{c |} {res}.86384915 {txt}{c |} {res}.86729091 {txt}{c |} {res}.77952236 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.77347435    {txt}{c |}    {res}.77347435    {txt}{c |}    {res}.81709644    {txt}{c |}    {res} .8028578    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  4. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  4 {txt}{c |} {res}AUTOPLANALTOSUL {txt}{c |} {res}.94394811 {txt}{c |} {res}.82448994 {txt}{c |} {res}.82739796 {txt}{c |} {res}.82664944 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.82208123    {txt}{c |}    {res}.82208124    {txt}{c |}    {res}.83542508    {txt}{c |}    {res}.81717495    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  5. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  5 {txt}{c |} {res}      AUTOREGIS {txt}{c |} {res}1.1052615 {txt}{c |} {res}.96538889 {txt}{c |} {res}.96825073 {txt}{c |} {res}.70034691 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.69603299    {txt}{c |}    {res}  .696033    {txt}{c |}    {res}.79252229    {txt}{c |}    {res}.80037805    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  6. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  6 {txt}{c |} {res}       CCRPONTE {txt}{c |} {res}.98364393 {txt}{c |} {res}.85916219 {txt}{c |} {res}.85495246 {txt}{c |} {res}.79992623 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.80320396    {txt}{c |}    {res}.80320398    {txt}{c |}    {res} .8256521    {txt}{c |}    {res} .8085365    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  7. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  7 {txt}{c |} {res}       CONCEBRA {txt}{c |} {res}.94719685 {txt}{c |} {res}.82732755 {txt}{c |} {res}.82960345 {txt}{c |} {res}.83057167 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.82762271    {txt}{c |}    {res}.82762272    {txt}{c |}    {res}.83231018    {txt}{c |}    {res}.83014434    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  8. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  8 {txt}{c |} {res}        CONCEPA {txt}{c |} {res}.78458098 {txt}{c |} {res}.68529098 {txt}{c |} {res}.68444665 {txt}{c |} {res}        1 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}        1    {txt}{c |}    {res}        1    {txt}{c |}    {res}        1    {txt}{c |}    {res}        1    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
  9. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res}  9 {txt}{c |} {res}         CONCER {txt}{c |} {res}.97855476 {txt}{c |} {res}.85471706 {txt}{c |} {res}.85544998 {txt}{c |} {res}.79503386 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.79238658    {txt}{c |}    {res}.79238658    {txt}{c |}    {res}.82301419    {txt}{c |}    {res}.83224483    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 10. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 10 {txt}{c |} {res}            CRO {txt}{c |} {res}1.1035419 {txt}{c |} {res}.96388691 {txt}{c |} {res}.96873956 {txt}{c |} {res}.70020289 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.69428152    {txt}{c |}    {res}.69428152    {txt}{c |}    {res}.79206075    {txt}{c |}    {res} .8058161    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 11. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 11 {txt}{c |} {res}            CRT {txt}{c |} {res}.99988638 {txt}{c |} {res}.87334914 {txt}{c |} {res}.86729091 {txt}{c |} {res}.81943419 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.82944787    {txt}{c |}    {res}.82944788    {txt}{c |}    {res}.81241191    {txt}{c |}    {res}.83626075    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 12. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 12 {txt}{c |} {res}         ECO101 {txt}{c |} {res}.91893066 {txt}{c |} {res}.80263849 {txt}{c |} {res}.80098363 {txt}{c |} {res}.87758161 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.88190322    {txt}{c |}    {res}.88190324    {txt}{c |}    {res}.84980354    {txt}{c |}    {res}.83880336    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 13. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 13 {txt}{c |} {res}       ECOPONTE {txt}{c |} {res}1.1260724 {txt}{c |} {res}.98356611 {txt}{c |} {res}.98113396 {txt}{c |} {res}.69385182 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.69428152    {txt}{c |}    {res}.69428152    {txt}{c |}    {res}.79165789    {txt}{c |}    {res}.79729654    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 14. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 14 {txt}{c |} {res}         ECOSUL {txt}{c |} {res}1.0047395 {txt}{c |} {res}.87758812 {txt}{c |} {res}.86729091 {txt}{c |} {res}.85603277 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.87698533    {txt}{c |}    {res}.87698534    {txt}{c |}    {res}.80681844    {txt}{c |}    {res}.82645857    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 15. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 15 {txt}{c |} {res}    MGORODOVIAS {txt}{c |} {res}1.0560076 {txt}{c |} {res}.92236816 {txt}{c |} {res}.92506402 {txt}{c |} {res}.74064389 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.73724673    {txt}{c |}    {res}.73724674    {txt}{c |}    {res} .7984021    {txt}{c |}    {res}.80460514    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 16. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 16 {txt}{c |} {res}          MSVIA {txt}{c |} {res}.94013907 {txt}{c |} {res}.82116294 {txt}{c |} {res}.82624587 {txt}{c |} {res}.81868181 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.81035751    {txt}{c |}    {res}.81035752    {txt}{c |}    {res}.83763656    {txt}{c |}    {res}.83861085    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 17. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 17 {txt}{c |} {res}      NOVADUTRA {txt}{c |} {res}1.0696425 {txt}{c |} {res}.93427752 {txt}{c |} {res}.93145031 {txt}{c |} {res}.73958493 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.74182028    {txt}{c |}    {res}.74182029    {txt}{c |}    {res}.79820433    {txt}{c |}    {res}.81879259    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 18. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 18 {txt}{c |} {res}   RODOVIADOACO {txt}{c |} {res}1.1448874 {txt}{c |} {res}        1 {txt}{c |} {res}        1 {txt}{c |} {res}.69385182 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.69428152    {txt}{c |}    {res}.69428152    {txt}{c |}    {res} .7882676    {txt}{c |}    {res}.80042028    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 19. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 19 {txt}{c |} {res}TRANSBRASILIANA {txt}{c |} {res}1.0939152 {txt}{c |} {res}.95547844 {txt}{c |} {res}.95491452 {txt}{c |} {res}.73164703 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.73334737    {txt}{c |}    {res}.73334738    {txt}{c |}    {res}.79267071    {txt}{c |}    {res}.80155139    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 20. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 20 {txt}{c |} {res}         VIA040 {txt}{c |} {res}1.0642429 {txt}{c |} {res}.92956121 {txt}{c |} {res}.93281022 {txt}{c |} {res}.73569192 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.73201708    {txt}{c |}    {res}.73201709    {txt}{c |}    {res}.79665893    {txt}{c |}    {res}.81179582    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

     {c TLC}{hline 5}{c TT}{hline 17}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TT}{hline 11}{c TRC}
 21. {c |} dmu {c |}            conc {c |}   eff_ols {c |}  eff_cols {c |}  eff_cmad {c |}    eff_hn {c |}
     {c |} {res} 21 {txt}{c |} {res}       VIABAHIA {txt}{c |} {res}.94204542 {txt}{c |} {res}.82282804 {txt}{c |} {res}.82436718 {txt}{c |} {res}.83463546 {txt}{c |}
     {c LT}{hline 5}{c BT}{hline 11}{c TT}{hline 5}{c BT}{hline 11}{c +}{hline 11}{c BT}{hline 5}{c TT}{hline 5}{c BT}{hline 11}{c RT}
     {c |}      eff_hnx    {c |}     eff_hnx2    {c |}      eff_exp    {c |}     eff_expx    {c |}
     {c |}    {res}.83232845    {txt}{c |}    {res}.83232847    {txt}{c |}    {res}.83682646    {txt}{c |}    {res} .8137024    {txt}{c |}
     {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BT}{hline 17}{c BRC}

{com}. estimates table OLS COLS CMAD sfa_hn sfa_hn_ex sfa_hn_ex2 sfa_exp sfa_exp_ex, b  star (.01 .05 .1)   //stats(N r2 r2_o r2_b r2_w F chi2)drop(_cons)
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 12:Variable} {c |} {center 13:OLS} {space 1} {center 13:COLS} {space 1} {center 13:CMAD} {space 1} {center 13:sfa_hn} {space 1}
{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:-.03365228}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.03365228}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.04220981}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:.03952579}{lalign 3:}{txt} {space 1}{res} {ralign 10:.03952579}{lalign 3:}{txt} {space 1}{res} {ralign 10:.04681802}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.3216864}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.3216864}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.3252799}{lalign 3:***}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}l_avg        {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.08910785}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:.07470812}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:1.6002011}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2v      {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-36.064287}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2u      {txt}{c |}{res}
{txt}{space 9}npp {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 8}tarm {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa2 {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa3 {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:-3.6920122}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 78:legend: * p<.1; ** p<.05; *** p<.01}

{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 12:Variable} {c |} {center 13:sfa_hn_ex} {space 1} {center 13:sfa_hn_ex2} {space 1} {center 13:sfa_exp} {space 1} {center 13:sfa_exp_ex} {space 1}
{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}l_avg        {txt}{c |}{res}
{txt}{space 6}l_cust {c |}{res} {ralign 10:-.10586964}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-.10586964}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-.02685752}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.04232033}{lalign 3:*}{txt} {space 1}
{res}{txt}{space 7}l_rec {c |}{res} {ralign 10:.08719631}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.08719631}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.04104842}{lalign 3:}{txt} {space 1}{res} {ralign 10:.05190909}{lalign 3:*}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.6321111}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.6321111}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.3307064}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.3439622}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2v      {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-36.321068}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-37.194397}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-5.5933162}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-5.3382805}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig2u      {txt}{c |}{res}
{txt}{space 9}npp {c |}{res} {ralign 10:.46996408}{lalign 3:**}{txt} {space 1}{res} {ralign 10:.18135173}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:.2562408}{lalign 3:}{txt} {space 1}
{res}{txt}{space 8}tarm {c |}{res} {ralign 10:.12188596}{lalign 3:}{txt} {space 1}{res} {ralign 10:.1756853}{lalign 3:***}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:.3530081}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa2 {c |}{res} {ralign 10:-1.6200253}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 5}dEtapa3 {c |}{res} {ralign 10:-2.7303411}{lalign 3:**}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-5.7484631}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-5.8935897}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-5.4387036}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-10.142913}{lalign 3:*}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 78:legend: * p<.1; ** p<.05; *** p<.01}
{res}{txt}
{com}. 
. esttab using "summary_eff_sfa_all.tex" , tex replace
{res}{txt}(output written to {browse  `"summary_eff_sfa_all.tex"'})

{com}. 
. save results_sfa, replace
{txt}file results_sfa.dta saved

{com}. 
. savesome dmu conc etp eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp eff_expx using eff_sfa, replace
{txt}file eff_sfa.dta saved

{com}. 
. est clear  // clear the est locals
{res}{txt}
{com}. summarize eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp eff_expx

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}         21    1.003918     .089346    .784581   1.144887
{txt}{space 4}eff_cols {c |}{res}         21    .8768701    .0780392    .685291          1
{txt}{space 4}eff_cmad {c |}{res}         21     .877152    .0781568   .6844466          1
{txt}{space 6}eff_hn {c |}{res}         21    .7918973    .0771395   .6938518          1
{txt}{space 5}eff_hnx {c |}{res}         21    .7914288     .078948   .6942815          1
{txt}{hline 13}{c +}{hline 57}
{space 4}eff_hnx2 {c |}{res}         21    .7914288     .078948   .6942815          1
{txt}{space 5}eff_exp {c |}{res}         21    .8248471    .0466663   .7882676          1
{txt}{space 4}eff_expx {c |}{res}         21    .8246612    .0424217   .7972965          1
{txt}
{com}. 
. 
. est clear  // clear the est locals
{txt}
{com}. estpost tabstat eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp eff_expx, c(stat) stat(mean sd min max n)

{txt}Summary statistics: mean sd min max count
     for variables: eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp eff_expx

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(count)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:eff_ols}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.003918}}}{space 1}{space 1}{ralign 9:{res:{sf:  .089346}}}{space 1}{space 1}{ralign 9:{res:{sf:  .784581}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.144887}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}
{space 0}{space 0}{ralign 12:eff_cols}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8768701}}}{space 1}{space 1}{ralign 9:{res:{sf: .0780392}}}{space 1}{space 1}{ralign 9:{res:{sf:  .685291}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}
{space 0}{space 0}{ralign 12:eff_cmad}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  .877152}}}{space 1}{space 1}{ralign 9:{res:{sf: .0781568}}}{space 1}{space 1}{ralign 9:{res:{sf: .6844466}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}
{space 0}{space 0}{ralign 12:eff_hn}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7918973}}}{space 1}{space 1}{ralign 9:{res:{sf: .0771395}}}{space 1}{space 1}{ralign 9:{res:{sf: .6938518}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}
{space 0}{space 0}{ralign 12:eff_hnx}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7914288}}}{space 1}{space 1}{ralign 9:{res:{sf:  .078948}}}{space 1}{space 1}{ralign 9:{res:{sf: .6942815}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}
{space 0}{space 0}{ralign 12:eff_hnx2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7914288}}}{space 1}{space 1}{ralign 9:{res:{sf:  .078948}}}{space 1}{space 1}{ralign 9:{res:{sf: .6942815}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}
{space 0}{space 0}{ralign 12:eff_exp}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8248471}}}{space 1}{space 1}{ralign 9:{res:{sf: .0466663}}}{space 1}{space 1}{ralign 9:{res:{sf: .7882676}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}
{space 0}{space 0}{ralign 12:eff_expx}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8246612}}}{space 1}{space 1}{ralign 9:{res:{sf: .0424217}}}{space 1}{space 1}{ralign 9:{res:{sf: .7972965}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}

{com}. esttab using "summary_eff_sfa.tex" , ///
>  cells("mean(fmt(%13.2fc)) sd(fmt(%13.2fc)) min(fmt(%13.2fc)) max(fmt(%13.2fc)) count(fmt(%13.0fc))") nonumber ///
>   nomtitle nonote noobs label collabels("Mean" "SD" "Min" "Max" "N") tex replace
{res}{txt}(output written to {browse  `"summary_eff_sfa.tex"'})

{com}. 
. est clear  // clear the est locals
{txt}
{com}. by etp, sort: summarize eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp eff_expx

{txt}{hline}
-> etp = 1

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}          6    .9701747    .0966106    .784581   1.069643
{txt}{space 4}eff_cols {c |}{res}          6    .8473975    .0843844    .685291   .9342775
{txt}{space 4}eff_cmad {c |}{res}          6    .8434802     .082993   .6844466   .9314503
{txt}{space 6}eff_hn {c |}{res}          6     .835002     .089265   .7395849          1
{txt}{space 5}eff_hnx {c |}{res}          6    .8406407    .0898188   .7418203          1
{txt}{hline 13}{c +}{hline 57}
{space 4}eff_hnx2 {c |}{res}          6    .8406407    .0898188   .7418203          1
{txt}{space 5}eff_exp {c |}{res}          6    .8443502    .0769283   .7982043          1
{txt}{space 4}eff_expx {c |}{res}          6    .8537155    .0723443   .8085365          1

{txt}{hline}
-> etp = 2

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}          8    1.013136    .0924028   .8832652   1.144887
{txt}{space 4}eff_cols {c |}{res}          8     .884922     .080709   .7714865          1
{txt}{space 4}eff_cmad {c |}{res}          8    .8868412    .0801149   .7728591          1
{txt}{space 6}eff_hn {c |}{res}          8    .7778257    .0687387   .6938518   .8881588
{txt}{space 5}eff_hnx {c |}{res}          8    .7748064    .0680155   .6942815    .885485
{txt}{hline 13}{c +}{hline 57}
{space 4}eff_hnx2 {c |}{res}          8    .7748064    .0680155   .6942815    .885485
{txt}{space 5}eff_exp {c |}{res}          8    .8196449    .0315185   .7882676   .8821006
{txt}{space 4}eff_expx {c |}{res}          8    .8085651    .0091776    .800378   .8250726

{txt}{hline}
-> etp = 3

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}eff_ols {c |}{res}          7    1.022304    .0849907   .9189307   1.126072
{txt}{space 4}eff_cols {c |}{res}          7    .8929302     .074235   .8026385   .9835661
{txt}{space 4}eff_cmad {c |}{res}          7    .8949401     .074199   .8009836    .981134
{txt}{space 6}eff_hn {c |}{res}          7    .7710322      .07108   .6938518   .8775816
{txt}{space 5}eff_hnx {c |}{res}          7    .7682443    .0723785   .6942815   .8819032
{txt}{hline 13}{c +}{hline 57}
{space 4}eff_hnx2 {c |}{res}          7    .7682443    .0723785   .6942815   .8819032
{txt}{space 5}eff_exp {c |}{res}          7    .8140757    .0248338   .7916579   .8498035
{txt}{space 4}eff_expx {c |}{res}          7    .8181532      .01732   .7972965   .8388034

{txt}
{com}. 
. esttab using "summary_eff_sfa_byetp.tex" , tex replace
{res}{txt}(output written to {browse  `"summary_eff_sfa_byetp.tex"'})

{com}. 
. /*est clear  // clear the est locals
> estpost tabstat eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp eff_expx, c(stat) stat(mean sd min max n)
> esttab using "summary_eff_sfa.tex" , ///
>  cells("mean(fmt(%13.2fc)) sd(fmt(%13.2fc)) min(fmt(%13.2fc)) max(fmt(%13.2fc)) count(fmt(%13.0fc))") nonumber ///
>   nomtitle nonote noobs label collabels("Mean" "SD" "Min" "Max" "N") tex replace*/
. 
. 
. 
. 
. export delimited conc  tar etp npp ext dEtapa2 dEtapa3 custm recm avgm tarm dmu eff_ols eff_cols eff_cmad eff_hn eff_hnx eff_hnx2 eff_exp eff_expx using "sfa_results.csv",replace
{res}{txt}file sfa_results.csv saved

{com}. 
. * close log file
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\Google Drive\_DOUTORADO\__TESE\__CODEandDATA\__TESE_code-data\efficiency\Stata\SFA\logSFA. 5 Mar 202120_12_39.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Mar 2021, 20:12:44
{txt}{.-}
{smcl}
{txt}{sf}{ul off}